{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "# Python notebook \n",
    "\n",
    "## In memory approach as opposed to a database\n",
    "Amazon co-purchase data analysis\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 239,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import matplotlib.pyplot as plt\n",
    "import networkx as nx\n",
    "import pickle\n",
    "import pandas as pd\n",
    "from neo4jrestclient.client import GraphDatabase\n",
    "from neo4jrestclient.constants import RAW\n",
    "from neo4jrestclient.client import Node "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 240,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "file = 'C:/Users/moore/Dropbox/graphs/Amazon0601.txt'\n",
    "location_gml = 'C:/Users/moore/Dropbox/graphs/Amazon.gml'\n",
    "location_pickle = 'C:/Users/moore/Dropbox/graphs/Amazon.gpickle'\n",
    "file_meta = 'C:/Users/moore/Dropbox/graphs/Amazon-meta.txt'\n",
    "pickle_meta = 'C:/Users/moore/Dropbox/graphs/AmazonMeta.p'\n",
    "location_pairs = 'C:/Users/moore/Dropbox/graphs/Amazon.p'\n",
    "\n",
    "review_csv = 'C:/Users/moore/Dropbox/graphs/reviews.csv'\n",
    "sims_csv = 'C:/Users/moore/Dropbox/graphs/sims.csv'\n",
    "prods_csv = 'C:/Users/moore/Dropbox/graphs/prods.csv'\n",
    "bought_csv = 'C:/Users/moore/Dropbox/graphs/bought.csv'\n",
    "cats_csv = 'C:/Users/moore/Dropbox/graphs/cats.csv'\n",
    "prods_csv = 'C:/Users/moore/Dropbox/graphs/prods_dataframe.csv'\n",
    "product_details = 'C:/Users/moore/Dropbox/graphs/prods_data.p'\n",
    "pair_listing = 'C:/Users/moore/Dropbox/graphs/pair_list.p'\n",
    "pair_dictionary = 'C:/Users/moore/Dropbox/graphs/pair_dict.p'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 241,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def in_memory():\n",
    "    restructured = pickle.load(open(product_details, 'rb'))\n",
    "    pair_dict = pickle.load(open(pair_dictionary, 'rb'))\n",
    "    paths = pickle.load(open(pair_listing, 'rb')) \n",
    "    records = []\n",
    "    for path in paths:\n",
    "        dic = {}\n",
    "        pairs = (path[0],path[1])\n",
    "        try:\n",
    "            a = pair_dict[pairs[1]]\n",
    "        except:\n",
    "            a = 0\n",
    "        dic = {'Title': restructured[pairs[0]]['title'], \n",
    "           'co_purNum': pair_dict[pairs[0]], \n",
    "           'pair Title': restructured[pairs[1]]['title'], \n",
    "           'pair_Count': a}\n",
    "        records.append(dic)\n",
    "    \n",
    "    df = pd.DataFrame.from_records(records)\n",
    "    return df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 242,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def neo4j():\n",
    "    from neo4jrestclient.client import GraphDatabase\n",
    "    from neo4jrestclient.constants import RAW\n",
    "    from neo4jrestclient.client import Node \n",
    "    q = \"\"\"MATCH p=(n)-[r:co_pur]->(w) RETURN n.title, n.id, n.cats, n.status, w.title, w.id, w.cats, w.status\"\"\"\n",
    "    db = GraphDatabase(\"http://localhost:7474/db/data\")\n",
    "    #retrieve a list of all nodes with the labels\n",
    "    params = {}\n",
    "    results = db.query(q, params=params, returns=RAW)\n",
    "    records = []\n",
    "    for prod in results:\n",
    "        records.append(prod)\n",
    "    \n",
    "    cols = ['n.title', 'n.id', 'n.cats', 'n.status', 'w.title', 'w.id', 'w.cats', 'w.status']\n",
    "    df = pd.DataFrame.from_records(records, columns=cols)  \n",
    "    return df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 243,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(3387388, 4) returned from in-memory approach \n",
      "Wall time: 9.99 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "shape=in_memory()\n",
    "print(shape, 'returned from in-memory approach ')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 244,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(3387388, 8) returned from Cypher query on local Neo4j database\n",
      "Wall time: 53.7 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "shape=neo4j()\n",
    "print(shape, 'returned from Cypher query on local Neo4j database')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 245,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "q = \"\"\"MATCH p=(n:Product) OPTIONAL MATCH (n)-[r:co_pur]->() RETURN n.id, n.status, n.sales_rank, count(r);\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 246,
   "metadata": {},
   "outputs": [],
   "source": [
    "def neo4(q):\n",
    "    from neo4jrestclient.client import GraphDatabase\n",
    "    from neo4jrestclient.constants import RAW\n",
    "    from neo4jrestclient.client import Node \n",
    "    db = GraphDatabase(\"http://localhost:7474/db/data\")\n",
    "    #retrieve a list of all nodes with the labels\n",
    "    params = {}\n",
    "    results = db.query(q, params=params, returns=RAW)\n",
    "    records = []\n",
    "    for prod in results:\n",
    "        records.append(prod)  \n",
    "    return records    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 267,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "q = \"\"\"MATCH p=(n:Product) OPTIONAL MATCH (n)-[r:co_pur]->() RETURN n.id, n.status, n.sales_rank, count(r);\"\"\"\n",
    "records = neo4(q)\n",
    "cols = ['n.id', 'n.status', 'n.sales_rank', 'count_sim']\n",
    "df = pd.DataFrame.from_records(records, columns=cols)  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 268,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.id</th>\n",
       "      <th>n.status</th>\n",
       "      <th>n.sales_rank</th>\n",
       "      <th>count_sim</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0684839385</td>\n",
       "      <td>active</td>\n",
       "      <td>1578</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0375431500</td>\n",
       "      <td>active</td>\n",
       "      <td>712907</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B000007WEG</td>\n",
       "      <td>active</td>\n",
       "      <td>114054</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B00004TUS6</td>\n",
       "      <td>active</td>\n",
       "      <td>163174</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0307106519</td>\n",
       "      <td>active</td>\n",
       "      <td>994870</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         n.id n.status n.sales_rank  count_sim\n",
       "0  0684839385   active         1578         10\n",
       "1  0375431500   active       712907          3\n",
       "2  B000007WEG   active       114054         10\n",
       "3  B00004TUS6   active       163174         10\n",
       "4  0307106519   active       994870          7"
      ]
     },
     "execution_count": 268,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 269,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "df['count_sim'] = df['count_sim'].fillna(0)\n",
    "df['n.sales_rank'] = df['n.sales_rank'].fillna(0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 270,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 548552 entries, 0 to 548551\n",
      "Data columns (total 4 columns):\n",
      "n.id            548552 non-null object\n",
      "n.status        548552 non-null object\n",
      "n.sales_rank    548552 non-null object\n",
      "count_sim       548552 non-null int64\n",
      "dtypes: int64(1), object(3)\n",
      "memory usage: 16.7+ MB\n"
     ]
    }
   ],
   "source": [
    "df.info()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 271,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\moore\\Anaconda3\\lib\\site-packages\\sklearn\\utils\\validation.py:475: DataConversionWarning: Data with input dtype object was converted to float64 by MinMaxScaler.\n",
      "  warnings.warn(msg, DataConversionWarning)\n"
     ]
    }
   ],
   "source": [
    "import matplotlib.pyplot as plt\n",
    "from sklearn.preprocessing import MinMaxScaler\n",
    "scaler = MinMaxScaler()\n",
    "scaled = scaler.fit_transform(df['n.sales_rank'].values.reshape(-1, 1))\n",
    "df['scaled'] = scaled"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 272,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "count    548552.000000\n",
       "mean          0.127448\n",
       "std           0.149254\n",
       "min           0.000000\n",
       "25%           0.022571\n",
       "50%           0.077478\n",
       "75%           0.175329\n",
       "max           1.000000\n",
       "Name: scaled, dtype: float64"
      ]
     },
     "execution_count": 272,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df['scaled'].describe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 273,
   "metadata": {},
   "outputs": [],
   "source": [
    "df['scaled'] = df.scaled.apply(lambda x: (x*100)).astype(int)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 274,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.id</th>\n",
       "      <th>n.status</th>\n",
       "      <th>n.sales_rank</th>\n",
       "      <th>count_sim</th>\n",
       "      <th>scaled</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0684839385</td>\n",
       "      <td>active</td>\n",
       "      <td>1578</td>\n",
       "      <td>10</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0375431500</td>\n",
       "      <td>active</td>\n",
       "      <td>712907</td>\n",
       "      <td>3</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>B000007WEG</td>\n",
       "      <td>active</td>\n",
       "      <td>114054</td>\n",
       "      <td>10</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>B00004TUS6</td>\n",
       "      <td>active</td>\n",
       "      <td>163174</td>\n",
       "      <td>10</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0307106519</td>\n",
       "      <td>active</td>\n",
       "      <td>994870</td>\n",
       "      <td>7</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         n.id n.status n.sales_rank  count_sim  scaled\n",
       "0  0684839385   active         1578         10       0\n",
       "1  0375431500   active       712907          3      18\n",
       "2  B000007WEG   active       114054         10       3\n",
       "3  B00004TUS6   active       163174         10       4\n",
       "4  0307106519   active       994870          7      26"
      ]
     },
     "execution_count": 274,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 275,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "summ = df.groupby('scaled')['count_sim'].mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 277,
   "metadata": {},
   "outputs": [],
   "source": [
    "q = \"\"\"MATCH p=(n:Product) OPTIONAL MATCH (n)-[r:similar]->() RETURN n.id, n.status, n.avg_rating, count(r);\"\"\"\n",
    "records = neo4(q)\n",
    "cols = ['n.id', 'n.status', 'n.avg_rating', 'count_sim']\n",
    "df = pd.DataFrame.from_records(records, columns=cols)  \n",
    "df['count_sim'] = df['count_sim'].fillna(0)\n",
    "df['n.avg_rating'] = df['n.avg_rating'].fillna(0)\n",
    "summ2 = df.groupby('n.avg_rating')['count_sim'].mean()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 278,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\moore\\Anaconda3\\lib\\site-packages\\sklearn\\utils\\validation.py:475: DataConversionWarning: Data with input dtype object was converted to float64 by MinMaxScaler.\n",
      "  warnings.warn(msg, DataConversionWarning)\n"
     ]
    }
   ],
   "source": [
    "q = \"\"\"MATCH p=(n:Product) OPTIONAL MATCH (n)-[r:similar]->() RETURN n.id, n.status, n.sales_rank, count(r);\"\"\"\n",
    "records = neo4(q)\n",
    "cols = ['n.id', 'n.status', 'n.sales_rank', 'count_sim']\n",
    "df = pd.DataFrame.from_records(records, columns=cols)  \n",
    "df['count_sim'] = df['count_sim'].fillna(0)\n",
    "df['n.sales_rank'] = df['n.sales_rank'].fillna(0)\n",
    "scaled = scaler.fit_transform(df['n.sales_rank'].values.reshape(-1, 1))\n",
    "df['scaled'] = scaled\n",
    "df['scaled'] = df.scaled.apply(lambda x: (x*100)).astype(int)\n",
    "summ1 = df.groupby('scaled')['count_sim'].mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 290,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "q = \"\"\"MATCH p=(n:Product) OPTIONAL MATCH (n)-[r:co_pur]->() RETURN n.id, n.status, n.avg_rating, count(r);\"\"\"\n",
    "records = neo4(q)\n",
    "cols = ['n.id', 'n.status', 'n.avg_rating', 'count_sim']\n",
    "df = pd.DataFrame.from_records(records, columns=cols)  \n",
    "df['count_sim'] = df['count_sim'].fillna(0)\n",
    "df['n.avg_rating'] = df['n.avg_rating'].fillna(0)\n",
    "summ3 = df.groupby('n.avg_rating')['count_sim'].mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 285,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAl8AAAF0CAYAAAAdPFx1AAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAIABJREFUeJzsnXm4HEXV/z/fhLCEnRBlTSKLuLMY\nUFxR0DciCKKvogEDqBH0J6i4RwFR3AERRY2yJhFRQEAURNGgyKIB2ZEXlIQdQgIkAYRAzu+PqiGd\nyczcmXvv9My98/08Tz0zXV3L6eqemtNVp04pIjDGGGOMMeUwotMCGGOMMcb0Ela+jDHGGGNKxMqX\nMcYYY0yJWPkyxhhjjCkRK1/GGGOMMSVi5csYY4wxpkSsfJkhiaS9Jf1F0kOSnpQ0T9J5kib1o6yj\nJJXmc0XSaZKiEJ6QdK2kg0qo+6hc5yrtrqtG3Qfkuie0mG+9LPcONc7NljR7kETsF/mavtZEuo7L\naozpDkrvgI0ZKJIOBU4ATgG+AzwObAm8HXgzcHHnpGua+cA78vfnA4cBJ0taFBFnd06srmQ94Ejg\nHuDaqnMfLV+cfjOUZDXGtBErX2Yo8mngvIj4YCHuT8BPJQ2V0dynI+KqyoGkS4G7gQ8BQ0L5kjQS\nUEQ80ykZIuKWTtXdKkNJVmNMexkqf1TGFNkAeKDWiYhYVvkuaaykn0j6vzy1d7ekn0vatK8KJK0i\n6QuS/iXpKUn3STpW0upVab4q6d+S/ivpYUmXS3pdqxcUEUuA/wPGVcmxo6SzJd2Tp1dvk/R1SWtU\npZud694tT2E+IekmSXs3ca2TJC2R9INGymueXjtG0ucl3Qk8Dbw8n9tQ0o8k3Zvb61+SpjZR976S\n/iRpfpbhn5KmFM5PAO7Mhz8tTNUeULju2VVlbiPp15IezW12VfV0dGH6dWtJv811z5N0RLENJK0l\n6URJd+XrelDSHyW9qMa1HCrpTkmLJV0m6aVV51eQVdIuWYZ35anoRyQtkjRL0piqvIdJujVfzyOS\n5kh6Z1/ta4zpTjzyZYYifwemSPoPcH5E/F+ddBsA/wW+QJrm2wQ4HPibpBdFxH8b1DET2BP4FnAF\n8GLgq8AE4F05zeeATwLTgOuAdYCJud6WyKNImwPXVJ0al8s+DVgMvBQ4AtgC2Lcq7Zak6dhvAA+T\nrvXsfK131Kn3A8DPgK9GxFebEPUA4D+k0cfHgfskrQP8DVgDOIqkLP0P8CNJq0XEiQ3K24I00vdN\nYBnwBuBnktaIiB8D9wP7AOfm67og5/t3nevZBLic1Fb/D3gM+BjwW0l7RMRFVVl+DZwKHE+6318h\njUCems8fT5oe/iJwOzAGeC1pKrTIfsBtpOnjVUnT4efntu9rZPB7wB+B9wFbA18nPatvytc0GTgW\nOBr4K6mdX0E/njNjTJcQEQ4OQyoALwRuACKHh4Ezgbf2ka+i4ATwzkL8Uemn8Nzx63OaD1Tln5zj\nt8vHFwLn9kP+00j2S6vksAnwA5Iy86oG+ZTT70dSVMYUzs0GlgJbF+KeBzwLfLH6WnM5n815PtSk\n3AHcB6xRFf9lkpK7dVX8T/O9WSUfH5DLmFCn/BFZrp8C1xfiJ+R8K8mZr3t24fi7wDPAVlX3/Tbg\n2hrtcGBVeTcClxSObwKOa6JdbgdGFeLeneNf00DWXXKai+s8Z7vm4x8UZXdwcBj6wdOOZsgRaaRr\ne+CNwDGkkaF3Ar+X9KViWkmHSLpe0hLSn/Jd+dQ2DaqYRJpSOydPLa6itDrwknz+DfnzH8DueSru\ndZJWbeEyNiUpPkuBe0nG2AdFxNVV8q8j6VuS/g08ldPPICliW1eVeXtE3F45iIiHgIeomsrMHE8a\n5Xl3RPysBbkvjognq+ImAVcDd1a11+9JI0UvqVdYnvY7U9K9LG+PD9H4/jTiDcBVURjpi4hnScr5\ndnmUrshvq45vYsX2+gdwgKQvSpqYRyhr8YeIWFo4vjF/1mr7an5ZdfwrknK9c0GG7fL0526SRjdR\npjGmi7HyZYYkEfFsRPwlIr4UEbuRpq9uBI6UtD6ApI8DJ5GmdPYBdgJenYtYvUaxFZ5HmjpawnKF\nYClJkYGkUECaHjqSNC31V2CBpFMlbdjEJTwE7Ai8Cng/aarulBq2RKcCBwPfB96S83yszjUsrFHP\nUzXSQZriupnUNq1wf42455GUnqVV4Vf5/JgaeZC0FvAHYFvg86QRxx1Jq1hXa1GuChvUkfEBksK6\nflV8dZtVt9fHgZ8AB5GUoIckHV9DAapVDjR+zio8WDyIiKeBR0gKOsAZwCGkZ+X3wEJJ56pFlx3G\nmO7BNl9mWBAR90n6GcnmaWuSXdi+wKURcXglnaQXNFHcAtI02uvrnL8v17mUZBP2LUkbAXsAxwGj\ngff2UcfSiJiTv/9d0rWkqdRjSS4zUDLu3ws4KiJOKFzDy5u4hr7YlTSSd5Gk3SMZ/DdDLX9oC0jK\n5GF18txWJ35nYDzw+oi4vBKpgfkgWwhsVCN+I5LstRTUuuR2+QLwBUnjSdOJ3ySNjH5uAHIWeX7x\nII+grk8aESUigqQA/iS/WLyV9JycRVLIjDFDDI98mSGHpM3rnKqMGlVWQo4mjcAUObCJKi4mjVis\nGxFzaoT7qjNExAN5+u6PwMuaqKM6/23AD0nTmDvm6NVI9krV13BAq+XX4GaSzdHWwMWS1h5AWReT\n2v6uOu21uE6+yujRc9eXlYu9qtJVRpHWoG8uA15dHBXKU4XvBf7ZQJY+iYh5EXEsaYS15XvcgPdU\nHf8vqW++soYMj0TEWaSpysGUwRhTIh75MkORmyT9mbRS7U7SKsPdSdNzv4yIil3XxcDnJH2RNBL2\nZtLIRUMiYrakM0krBY/LeZeRDL93Bz4XEf8n6XzgepLjz0dIdmiTSKMU/eGbwFTSasY9I+IxSVcB\nh0u6n2S8fhDLp6MGRETcKmkX4M8kBWxSP5WT40nKzV8lHU8a6VqTpJC9PiKqlakKVwCLgB9KOjLn\n+RLpOtctpHuQNLq2r6QbSAsT7oyIBXVkOQD4Qy5zEcme7oXkEcVWkHQlaYXljaRp6DeSpklPb7Ws\nBrxU0qnAL7KcxwCXRcSlWYbppNWbV5JGGF8I7M9yG0RjzBDDypcZinyOpAQdTZqyeZbkI+vzpGX7\nFY4muQT4JGkk6zKSC4T/NFHHfiR7n4NIriSeAuaSbG4qNjp/IY1SfIw0inMX8G3Sn2fLRMRDkr5P\nmuLaPiL+SbLN+hFpVOxJ0ojHYaSVlgMmIm6T9EaSAnaJpP+JiEUtlvGYpNeQlMbPkZTDR0lK2DkN\n8s3PvqqOJbmbuI80bbwByZaukm6ZpA+RbOz+SOq3DiStGq0u8z4lP2vfIrXbaqQFGW+PiP7sfPAX\n0sjU53O9/wE+GRHf70dZ9TiMZDd4Fmmk8zfAoYXzfyNd7/4kpfQ+kiuUIzHGDEmUzAmMMcaUSWHU\n8S0R0erCB2PMEMY2X8YYY4wxJWLlyxhjjDGmRDztaIwxxhhTIh75MsYYY4wpEStfxhhjjDElYuXL\ndDWSviQpJJ3baVlMuUiakO/9hzotSzuRNFvS7H7k20XSUZLcjxszxPCP1nQ7H8ifb5dUc49AY3qU\nXUi+vtyPGzPE8I/WdC3ZcefWwO9IG12/r7MSmcFAUn83zTbGmGGBlS/TzUwhea//MHA3y0fBnkPS\nAXlq6jWSfilpsaQHJX0hn58k6Z+SHpf0D0mvrMr/Vkm/k3S/pCck3STp8LwfYCXNabmOWmGXQrpJ\nkq6U9KSkxySdJ2mbqvpmS7pc0m6Sri3UuXczDSLpBZJmSHpA0lOS/iPphKo0+0m6XtJ/JT2c02/c\nRNmVab6PSjpO0kNZvguLeyXmtCHpqDr5D6hqu3sk7SzpCklPknYBqJz/cG6HJyU9IumyrHQXGSnp\n6HyPHpX0G0mbVdW9r6Q/SZovaUm+51NqXONhkm4t1Dcne9kvptlH0lX52h+V9CtJ46rSvD/XsSTf\n6xslfaSJNt5X0r/yvbu5uu6cZnVJx+fnYkm+17+R9KJCmqNY7uF+aeV5LJz/Sm7Xx/Iz8CdJr+5L\nPmNMOVj5Ml2JpNVJ27r8IW9kPRPYUdKL62Q5nbT/3juB84CvS/oW8B3SVjPvJe0deJ6kVQv5tgAu\nJW0j9PZczlGsuEXQV4Gdq8LfgCdIWwohaRLwW9L+f+8FDiFtfHy5pOq9GLckbaNzHLAPcD9pH8mt\n+miTF5D2mXwD6Y/3bcBXgA0LaaYCM4Bbc9mfJ22pdJmktRqVX+ALpBHHA0lbJ72StPXQqCbzV7Mu\nad/CM7PMP8+yfheYTtob8z2kLZ3+Aoyryv8FYCvSPTqM1P6zqtJsQdqiaDKwN2mLnp9JOriSQNJk\n0lZGZ5K2p5qc82xQSHMwaUukW0j7gH6EdB8vU958XGn7opmk7ar2Jm0x9VPSVlZ1kbRbvvbbSffm\nO6TnYJuqpKsBawNfIz2Th5C2x7pK0kY5zc+Ak/P317H8uaywKWmfy71Je10+BPxF0isayWiMKYmI\ncHDoukBSYAJ4Xz7eJh9/syrdATn+iELcKqQ/m6XACwrx78hp31inTuW800gbZY+ok+7TpBG5vQtx\nc0h/qqsU4l6QZTiuEDc7x21diHteLu+LfbTJGSTlbpM650eS9p38c1X86/J1H9pH+RNyuluK1w68\nNsd/sBAXwFF18h9QiDstx+1VlXarfM3HNSHPZTXaPxq0w4h8H38KXF+I/wFwbYP61gIeA06pIcfT\nwCcK9S/sxzP9txpt+6p8LbMb5BtJ2jt0MWlfyUr8UTnvKn3UOzK3x23ACa3K7eDgMPjBI1+mW5kC\nLCKNYhERtwFXA/up9uquiypfIuIZ4A7g/yLizkKaf+XPzSsRkjaW9BNJ80h/sEtJIw7rkZSiFZC0\nJ2kk7XMRcV6OWxPYATgr112R407SH+4bq4q5PSJuL6R7iKQsVo/4VPNW4MJII4G12CbLvMKoUERc\nDsyryCFphKRVCqG6Pc+OiGWF/H8D7mHFkZVWeIaVNwLfjaQkTW8i/2+rjm/Mn8+1l6StJZ0p6V7S\nPVwKfIgVR5X+AWwn6USlad/RVeXuDKwDzCq2D+na/0UacayUs76kmZL2kNRwxCvLNxLYkZXb9mrS\nhu3V6d8j6WpJj5La73GSclg9Slavvt0k/VnSgpx/KfDCZvMbY9qLlS/TdeSplbeS/nRXk7Re/oM7\nhzSdsmuNbI9UHT9dJw7SFA5Z6bgA2IOkcL2Z9Ad5TDFdQa5tSdNGJ0fEdwun1ieNmt1fQ64HKExr\nZRbWSPdUdX01GENSBOpRqacvOU5huYKyNB8XebBG/gdJbd8fHoqIZ6viKitXG11Pher2eip/Vu7j\nWsAfgG1J06yvJ93HU0hTeBXOIE3hvQr4PbBQ0rkFe7aKsv1HVmyfpcDLKzJHxGWkqcbNgV8D8yX9\nsY8pvQ2BUdRv2+fICv5ZpKnj92d5dwTm0/czgqQdSItUlgAfBF6d81/fTH5jTPtZpdMCGFOD/UhT\nJe+j9grHKaQ/24GyJTAR2D8iZlYi85/fCkh6PklRuwr4aNXpR0jTPxtV58txCwZBVoCHaawAVZSU\nenLMyd+PIk3BFcst8vwa+Z8PXFc4foq0ArVIPVcgtfYwq9S5KWk6bCDsDIwHXp9H+QDIo1bLhYgI\n4CfATyStT1LwjyUpOq9i+X06ALi5Rj2LC2WdTbLTW4vk8uFbwMWSNiuObBV4mKTE1WvbeYXjfYE7\nIuKAwrWMYmUlvh7vIo127RMRSwtlrA882mQZxpg24pEv0418gPRn9KYa4WLgnRXj5wFSmXYq/kGN\nIhliU4hbHTifNPXzv8WpRYCIeBy4BvhfrbhKcjzwGpJh9mBwCbCH6q9cvI00irJvlfyvISknl2V5\n50bEnEKYW1XOu4tTkZJeC2wGXFlIM49kiF7k7S1cyx+BZcDUFvLUo9Z9XB/Yq16GiHgkIs4Cfsny\n67iCpGBtVdU+lbCSkhgRSyLiQpJStzF1FNA88vcPVm7bV5Fsyqqv55mquP1JLyRFKiOAa9TI/ywF\npVfSm+l7WtsYUxIe+TJdRZ4yeTnJmHt2jfOrA5NIK9FOHWB1t5KUiGMkPUv68/5kjXTfI9l0HQC8\nSFLx3C0RsQj4Mmma9EJJJ5Hsc75CMuA+doByVjiSpOBcIenrJLu2TYFJEbFfRDwr6QjSyM5M0oq8\nTUnTqLfTfHutTVoV+hNgLPCNnP+MQppfAF+SNI00Gvh6WvDDFhH/lnQ88KmsSF9AUhh2Av6VFaNm\nuYJkH/hDSUeSVrV+iTTatG4lkaTpJOXqSpKN3QtJSs0lWaZFkj6TyxlLsiN8jNSGbyQZxf9c0tGk\n0ao/A/eRFNNDgesiYn4DOY/MdRXb9iukKeEiFwN75/a5kLTa9FBWHrW6JX8eLuki4NmImJPzfwI4\nTdKp+Tq/DNzbQDZjTJl02uLfwaEYSEvvlwHj65wfQXLvMDsfH0B6w9+qKt1s4PKquAk57YcKcdsB\nl5PcRtwDHE0y1A5gQqGsqBN2KZQ1ifTH/iTpT/t8YJu+5Mrxc4HTmmifLUmuEh4mjXz8Bzi+Ks1+\nJPuep0hTaTOAjZsou9I+HyW5wZif2+W3FFaN5rSr53t1P0mhOYukONVa7XhPgzoPBm7Isi7M7bNz\nvfuV43ep0fZvBv6Z2/7fJGXlKPJsY04zJZf/UK7vTpI7hnWqyt+dpFgtyuXdQbIfe0k+/3aSzdj9\nuZy7SW4faq6+rCr7faQRyqdIU5vvzDLNrnrGv0ZS7J4gjVhuX/2MkEbCfpivZ1nVtX48X9+TpBG3\n3arrcXBw6FxQRC1zDGNMr5ENz+8EPhwRP+usNMYYM3yxzZcxxhhjTIlY+TLGGGOMKRFPOxpjjDHG\nlIhHvowxxhhjSsTKlzHGGGNMiVj5MsYYY4wpEStfxhhjjDElYuXLGGOMMaZErHwZY4wxxpSIlS9j\njDHGmBKx8mWMMcYYUyJWvowxxhhjSsTKlzHGGGNMiVj5MsYYY4wpEStfxhhjjDElYuXLGGOMMaZE\nrHwZY4wxxpSIlS9jjDHGmBJpq/Ilaa6k3dpZx2Ai6ShJM9tU9i6S7hlA/h9L+vJgylSjjpC0VZ1z\nkyVd0s76hxOSZkv60CCX+XpJtw1mmYNBGc9mr+G+c4Wy3XcOMgPpSySNk7RE0sh8POh9XTvplt9W\nn8qXpNdJukLSY5IWSvqbpB3LEK6OPHMlPZlv/gOSTpO0VqfkaQeSDpB0eTEuIg6OiK92SqaImBUR\nb+1P3nZ2zL1ERPw1IrbptBzVdPrZ7Fbcd5aP+86mZep3XxIRd0XEWhHx7GDLNVSo9Zy1SkPlS9I6\nwIXAicAGwKbAV4CnBlLpILBnRKwFbAdsD3yhw/JQeQswvYGkVTotw1CgV9vJfWfzuO/sTQajbxjK\n/UtfI18vBIiIMyPi2Yh4MiIuiYgbACRtKelPkhZIeljSLEnr1SpI0ghJn5f075z+l5I2yOdWlzQz\nxz8q6R+Snt+X8BHxAPB7UkdSqeftkv4paZGkuyUdVTg3IQ8PT5F0V5Z5Wh15R0k6U9I5klatcf40\nST+S9DtJjwNvkrSapO/msh/Mw91r1Cm/0haLJd0i6Z05/sXAj4Gd8xvqo4X6vlbI/2FJd+Q36gsk\nbVI4F5IOlnS7pEck/VCS8rmtJF2W38YflnRWlWi71cm3gqaf6zhU0n9yOd+RtNLzJGkS8EXgvfl6\nrs/xm2S5F+br+HCtdspp15B0rKR5We7LK+0q6R2Sbs7PzezcfvXKOUrS2ZLOyu1+raRtq65pq8Lx\nc22uPPUh6XOSHgBOzfF7SbouP2//ztdbYbzSaMdiSZdI2rBQ9q+URh8ek/QXSS8tnNs9PxOLJd0r\n6dNFGQrp5kr6tKQbcjlnSVq9cP6zku6XdJ+kD1VfX1XbzJb0DUl/z2Wdr/z7bELehu0kaUNJF+Z7\ntFDSX2s9K8MM953uO7uh72ylL/mMUl/yuKSTJT1f0kU57x8lrZ/TVp6FlRSfvp7rXM/nJN0APF6n\njLrtk9vyb5KOl7QQOCr/Pr6k9P/wkKQzJK1bKG//fG5B9TNb49mobpfNJZ0raX7O/4MGz1nNtq5L\nRNQNwDrAAuB04G3A+lXntwLeAqwGjAX+AnyvcH4usFv+/gngKmCznP4nwJn53EeA3wCjgZHAK4F1\n6shULHMz4EbghML5XYCXkxTLVwAPAnvncxOAAH4KrAFsS3oTfXE+fxQwM5/7LXAaMLKOHKcBjwGv\nzXWtDnwPuID0prt2vqZvFOS6p5D/f4FNct73Ao8DG+dzBwCX16jva/n7m4GHgR1yW54I/KWQNkhv\n3esB44D5wKR87kxgWkHm1zWZbwWZcto/52sdB/wf8KE6bXUUMLMq7jLgpCzDdrmuXevk/yEwmzR6\nMBJ4Tb7uF+Z2ewswCvgscAewagM5lgLvzuk/DdwJjCpc01Z12nwX4BngW7nuNYCd8jPwltyemwIv\nyulnA//OMq6Rj79ZKPug/IysRnpuriucux94ff6+PrBDnWdoLvB30nO0AXArcHA+Nwl4AHgp6Xc1\no/r6qtpmNnAv8DJgTeCc4j3rQ96+2ukbpM5qVA6vB9So7xnqAfedp+G+sxv6zlb6kquA55P6sYeA\na0mjo6sBfwKOrHoWVin0HR9q4bm+DtgcWKOOzHXbJ7flM8DHgVVIz9tBpH5/C2At4FxgRk7/EmAJ\n8IYs03E5f+V38NyzUd0upN/T9cDxpD7xuXtefU8btXXdPqKJTuTFWcB7stAXAM+vk3Zv4J91fuy3\nFh8QYGPSH+EqufGuAF7RhDxzc2MuzjfpUmC9Bum/Bxxf9dBsVjj/d2DfwoN+Aenh/j4N/iBym5xR\nOBapE9iyELczcGeth71GedcBezXZgZwMfLtwbq3clhMKD2+xY/gl8Pn8/QxgerENqh76evlWkCmn\nnVQ4/ihwaTMdCOmH9yywdiHuG8BpNfKOAJ4Etq1x7svAL6vS3gvs0kCOq6rSF38wfSlfTwOrF87/\npPJs1ahrNvClqva5uE7a9XLd6+bju0h/qutUpVvhGSL9FvYrHH8b+HH+fgr5zysfb1V9fTXkLSqH\nL8nXu9IfaA15+2qno4Hz69U9XAPuO+uVexruO9ved+ZzrfQlkwvH5wA/Khx/HDiv6llYSflq8rk+\nqI/ntG775La8qyr9pcBHC8fbsPz3cQTwi8K5NUn9UzPK184kxXaVGjLWes5qtnW90OfQf0TcGhEH\nRMRmpLfiTUg/SiQ9T9Iv8hDbItKbz4Z1ihoP/FppaPxRUofyLEnTnkEaAv+F0hTJtyWNaiDW3hGx\ndm6oFxXrlPQqSX/Ow4SPAQfXkOmBwvcnSD/ACq8mvfV9M3KLNuDuwvexpLfPawrXeHGOXwlJH1Ca\nrqqkfVkNOeuxCTCvchARS0hv2ZsW0tS7xs+SOru/K03XHVRVdqO2qaZ4/fOyXM2wCbAwIhZX5d+0\nRtoNSW8c/65TTrEdlmWZNlVaYbQkh4tqyZzT39OC3PMj4r+F483ryFWhZltKGinpm0pTJ4tIHRIs\nv//vAnYH5uVpjp1brYN0TcX7U/xej+r7OQrYsAl5q6lup++Q3kwvyVMJn29CliGP+86GuO9cTrv6\nTmitL3mw8P3JGsd9Ls5o8rnuT1+0SZ1zUHVP8/dVSL+PFfrBiHicdL+bYXNgXkQ802T6Vtq6NVcT\nEfEvkqb4shz1DZKW+oqIWAfYj/Rw1uJu4G0RsV4hrB4R90bE0oj4SkS8hDSltAfwgSbkuSzL891C\n9M9Jb2CbR8S6pOmOejLV4pJ8XZeqb9uJYgfzMOkBfWnh+taNZNy6ApLGk4bv/x8wJiLWA24qyNlX\nx3UfqUOulLcmMIY06tNY4IgHIuLDEbEJSUs/SXXsgJpg88L3cVmumtVWHd8HbCBp7ar8teR/GPgv\nsGWNc9XtoCzTvZFWGK2Vw9tqyZztCDYryP0E6U+gwkZ9XMfddeTqi/cDewG7AeuS3iQh3/+I+EdE\n7AU8DziP9BbdKveTrq3C5vUS1kkzjvT2+HBf8tZghXaKiMURcXhEbAHsCXxK0q5NyDNscN+5sgiF\n7+4729N3DlZf0grNPNd93SNo3D612mR84XgcaaT5QVI/WOzzR5Pud4XHqd/n3w2Mq2WXVkOGltu6\nr9WOL5J0uKTN8vHmwPtIc8OQ5uaXAI9K2hT4TIPifgwck388SBoraa/8/U2SXq606mURqdNvdhnr\n94C3SKoYjq5NejP4r6SdSH8cLRER3yZ1RJeqYCTdR55lpE7heEnPA5C0qaT/qZF8TdLNm5/THcjy\nThnSQ7OZahirZn4OHChpO0mrAV8Hro6IuX3JKel/K/cTeCTL0d8lw5+RtH5+Lg4Dqg1QKzwITMjK\nDhFxN2mq5BtKBsOvAD4IzKrOmNv1FOA4JUPTkZJ2ztf9S+DtknbNb/uHk+xQrmgg8ysl7ZN/UJ/I\n6SvP83XA+3Mdk4A39nH9J5Puw65KRp+bSnpRH3kgPaNPkd7ARpPuHwCSVs2jdutGxFLS76E/9+eX\nWbYX5w7niCby7CfpJTn90cDZkZaT15W3GSTtoWSsLJZfz7Bepu6+031nH7S97xzEvqQVWnmuG9Fs\n+0CyxfukpBcouU75OnBWHrE6G9hDye3LqqR+raj3XAfsLmkDSRuR/hMq/J2kvH1T0pq5vV+bz63w\nnPWnrfsa+VoMvAq4WmlVylWkt4zD8/mvkAwXHyMZWZ7boKwTSG9Vl0hanMt6VT63EamRFpGG1C8j\nDVf2SUTMJ83FV5zofRQ4OtdxBP3U9CP5hTkP+KMKq7764HOk6ZWrlIZc/0iaf64u+xbgWOBK0k18\nOfC3QpI/ATcDD0h6uEb+S0nXew7p4dgS2LdJGXck3c8lpPtxWETc2WTeas4HriE9wL8lKSO1+FX+\nXCDp2vz9faQRlPuAX5OMOf9QJ/+nScbB/wAWkoy5R0TEbaQ3qxNJb897kpbSP92HzO8ldZ77A/vk\nHwukH/mewKPAZNL9r0tE/B04kGSQ+RjpuR3fKE/mDNLQ+L3ALSz/Q66wPzA3P0MH52tsiYi4iGR7\n82fSM3llPtXI1cEM0mjIA6R16d0IAAAgAElEQVSp3kOblLcvtib9FpZkOU6KiNktljHUcN/pvrMR\nZfWdA+5LWqSV57oRzbYPpJfzGSTj/jtJMyUfB4iIm4GPkZTu+0n9ftFh7wySUf1c0sjtc0pefvHc\nk2Qve1fO9958utZz1lJbq++peWNWRlIAW0fEHZ2WpVmUls5vFRHt7oC6DqXl0TcBq9WyYZA0m2TY\n+7OyZTOmlxiKfWeZ9Er7DHdfO8b0LJLemYfD1yeNFv6mBeNRY4wxbcLKlzHDl4+QbGP+TbI/OKSz\n4hhjjAFPOxpjjDHGlIpHvowxxhhjSsTKlzHGGGNMiQzZHcFbYcMNN4wJEyZ0WgxjBoVrrrnm4Yio\n6f3bmL5wf2iGE0O1P+wJ5WvChAnMmTOn02IYMyhImtd3KmNq4/7QDCeGan/oaUdjjDHGmBKx8mWM\nMcYYUyJWvowxxhhjSsTKlzHGGGNMiVj5MsYYY4wpka5WviSdIukhSTcV4jaQ9AdJt+fP9TspozHG\nGGNMK3S18gWcBkyqivs8cGlEbA1cmo+NGfLMmgUTJsCIEelz1qxOS2R6Cj+AxpRGVytfEfEXYGFV\n9F7A6fn76cDepQplTBuYNQumToV58yAifU6d6v8/UxJ+AI0pla5Wvurw/Ii4HyB/Pq/D8hgzYKZN\ngyeeWDHuiSdSvDFtxw+gMaUyFJWvppA0VdIcSXPmz5/faXGMachdd7UWb8yg4gfQmFIZisrXg5I2\nBsifD9VKFBHTI2JiREwcO3bIbftkeoxx41qLN2ZQ8QNoTKkMReXrAmBK/j4FOL+DshgzKBxzDIwe\nvWLc6NEp3pi24wfQmFLpauVL0pnAlcA2ku6R9EHgm8BbJN0OvCUfGzOkmTwZpk+H8eNBSp/Tp6d4\nY9qOH0BjSkUR0WkZ2s7EiRNjzpw5nRbDmEFB0jURMbHTcpihiftDM5wYqv1hV498GWOMMcYMN6x8\nGWOMWRk7XTWmbVj5MsaYLkTS6pL+Lul6STdL+kqNNKtJOkvSHZKuljRhUCq301Vj2oqVL2OM6U6e\nAt4cEdsC2wGTJL26Ks0HgUciYivgeOBbg1Kzna4a01asfBljTBcSiSX5cFQO1SukitutnQ3sKkkD\nrtxOV41pK1a+jDGmS5E0UtJ1JGfSf4iIq6uSbArcDRARzwCPAWMGXLGdrhrTVqx8GWNMlxIRz0bE\ndsBmwE6SXlaVpNYo10r+g1rebs1OV41pK1a+jDGmy4mIR4HZwKSqU/cAmwNIWgVYF1hYI39r263Z\n6aoxbcXKlzHGdCGSxkpaL39fA9gN+FdVsuJ2a+8G/hSD5Tl78mSYOxeWLUufVryMGTRW6bQAxhhj\narIxcLqkkaQX5V9GxIWSjgbmRMQFwMnADEl3kEa89u2cuMaYZvHIlzHGdCERcUNEbB8Rr4iIl0XE\n0Tn+iKx4ERH/jYj/jYitImKniPjPoAphR6vGtAWPfBljjFnOrFnJn9e8ecneqzKLWXG0Cp6CNGaA\neOTLGGNMoujZHpYrXhXsaNWYQcHKlzHGmEQtz/bV2NGqMQPGypcxxphEM4qVHa0aM2CsfBljjEn0\npVjZ0aoxg4KVL2OMMYlanu0rW0Xa0aoxg4aVL2OMMYlanu1nzEiG93a0asygYVcTxhhjljN5spUs\nY9pMacqXpPWBTYAngbkRsaysuo0xxhhjuoW2Kl+S1gU+BrwPWBWYD6wOPF/SVcBJEfHndspgjDHG\nGNNNtHvk62zgDOD1EfFo8YSkicB+kraIiJPbLIcxxhhjTFfQVuUrIt7S4NwcYE476zfGGGOM6TZK\nWe0o6dJm4owxxhhjhjvttvlaHRgNbJgN7rPDGNYhGd8bY4wxxvQU7bb5+gjwCZKidQ3Lla9FwA/7\nW6ikw4AP5/J+GhHfG6CcxhhjjDGl0NZpx4g4ISJeAHw6IraIiBfksG1E/KA/ZUp6GUnx2gnYFthD\n0taDKLYxxpgis2bBhAkwYkT6nDWr0xIZM6Qpxc9XRJwo6TXAhGKdEXFGP4p7MXBVRDwBIOky4J3A\ntwdBVGOMMUVmzYKpU+GJJ9LxvHnpGOyM1Zh+UpbB/Qzgu8DrgB1zmNjP4m4C3iBpjKTRwO7A5oMi\nqDHGmBWZNm254lXhiSdSvDGmX5Tl4X4i8JKIiIEWFBG3SvoW8AdgCXA98Ex1OklTgakA48aNG2i1\nxhjTm9x1V2vxxpg+KWtj7ZuAjQarsIg4OSJ2iIg3AAuB22ukmR4REyNi4tixYweramOM6S3qvbzW\nirdtmDFNUZbytSFwi6TfS7qgEvpbmKTn5c9xwD7AmYMkpzHGmCLHHAOjR68YN3p0ii9SsQ2bNw8i\n0uf++4NkRcyYKsqadjxqkMs7R9IYYCnwsYh4ZJDLN8YYA8uN6qdNS1ON48Ylxava2L6WbVjF0sRG\n+sasgAbBDKvrmThxYsyZ452MzPBA0jUR0d8FK6bHaVt/OGLEcmWrHuPHw9y5g1+36VmGan9Y1mrH\nxZIW5fBfSc9KWlRG3cYYY0qgmYVNNtI3BihJ+YqItSNinRxWB94F9MvJqjHGmC6hYmAvNadYeeW5\nMUB5Nl8rEBHnSfp8J+o2xpgykTSCtBvHJsCTwM0R8WBnpRoEqp2v9jXlWMtI35gepRTlS9I+hcMR\nJL9fw9/YzBjTs0jaEvgcsBvJHc58YHXghZKeAH4CnB4Ry+rk3xw4g+SmZxkwPSJOqEqzC3A+cGeO\nOjcijh78q6lBLQP7RkyfbmN7YzJljXztWfj+DDAX2Kukuo0xphN8DfgR8JFqB9PZXc77gf2B0+vk\nfwY4PCKulbQ2cI2kP0TELVXp/hoRewyy7H3Tiv3W+PFWvIwpUNbejgeWUY8xxnQLEfE+AEmrAU9V\nnX4sIr7XR/77gfvz98WSbgU2BaqVr84wblxyIdEXo0bBkiVpNWQ9NxXG9BhlrXbcTNKvJT0k6UFJ\n50jarIy6jTGmw1zZZFxdJE0AtgeurnF6Z0nXS7pI0ktbF6+f1HK+WkFKn2PGpO8LFix3vDp1qh2u\nmp6nLA/3pwIXkAxONwV+k+OMMWZYImkjSa8E1pC0vaQdctgFqKO11CxnLeAc4BMRUe2i51pgfERs\nC5wInFenjKmS5kiaM3/+/H5dD7Di9kHTpsGUKWlKEWDkyPQ5fjzMmJGUrbXWgqefXrEMb8ptTDlO\nViVdFxHb9RXXLuxk1QwnhqpTwV5D0hTgANICo2IHtBg4LSLObaKMUcCFwO8j4rgm0s8FJkbEw/XS\n9Ls/rF7dmCpMStb48bWnE+s5XpVgWc11Bsa0xFDtD8syuH9Y0n4s34PxfcCCkuo2xpjSiYjTgdMl\nvSsizmk1vyQBJwO31lO8JG0EPBgRIWkn0mxGe/rW/mwfVM8uzP6+TI9TlvJ1EMmp6vEkFxNX5Dhj\njBnuXCjp/cAECn1uEy4hXktaDXmjpOty3BeBcTn/j4F3A4dIeobkQ2zf6pWVg0Zfqxsr04lF5euY\nY1YeLbO/L2NKW+14F/COMuoyxpgu43zgMeAaVl71WJeIuBxQH2l+QFm7hTSzurFaQWt2U25jeoyy\nnKyeDhwWEY/m4/WBYyPCo1/GmOHOZhExqdNCDJhjjoEDD4SlS+unqTWdWK2AVYztrYCZHqas1Y6v\nqCheABHxCGnZtDHGDHeukPTyTgsxYCZPhnXWqX++3nRixVB/3jy7mzAmU5byNSKPdgEgaQM6tK+k\nMcaUzOtI3ulvk3SDpBsl3dBpofrFwoX1z9XbPqiWob7dTZgepywF6FjS29/ZJIP79wC2uDTG9AJv\n67QAg0Y9u69G2wfVM9RvZXsiY4YZpYx8RcQZwLuAB0mby+4TETPKqNsYYzpM1AlDj1pe7ftavVjP\nrYTdTZgeprSpv7wZbHfsSWaMMeXxW5KyJWB14AXAbUB5WwENFv1ZvWh3E8ashO2ujDGmjUTECsb2\nknYAPtIhcQbO5MmtrVS0uwljVsLKlzHGlEhEXCtpx07LUSqtKmzGDHOsfBljTBuR9KnC4QhgB5Lt\nqzGmRynLyepiVjYwfYy02ezhEfGfMuQwxpgOsHbh+zMkG7CW93o0xgwfyhr5Og64D/g5yeh0X2Aj\nktHpKcAuJclhjDGlEhFfAZC0djqMJR0WyRjTYcpysjopIn4SEYsjYlFETAd2j4izgPX7ymyMMUMV\nSS+T9E/gJuBmSddIelmn5TLGdI6ylK9lkt4jaUQO7ymcG5r+bowxpjmmA5+KiPERMR44PMf1HrNm\nwYQJMGJE+vQWQ6ZHKUv5mgzsDzxEcrS6P7CfpDWA/1eSDMYY0wnWjIg/Vw4iYjawZufE6RDe49GY\n5yhL+VocEXtGxIYRMTZ/vyMinoyIy/tToKRPSrpZ0k2SzpS0+mALbYwxg8B/JH1Z0oQcvgTc2Wmh\nSsd7PBrzHGUpX1dIukTSByWtN9DCJG0KHApMjIiXASNJRvzGGNNtHASMBc7NYUPgwI5K1Am8x6Mx\nz1HKaseI2FrSTiQFaZqkW4BfRMTMARS7CrCGpKXAaNJqSmOM6Soi4hHSy2JvU29Tbu/xaHqQska+\niIi/R8SngJ2AhcDpAyjrXuC7wF3A/cBjEXHJoAhqjDGDiKQ/FEf8Ja0v6fedlKkj9GdTbmOGKaUo\nX5LWkTRF0kXAFSSFaacBlLc+sBdpg9pNgDUl7VeVZqqkOZLmzJ9vZ9LGmI6xYUQ8WjnII2HP66A8\nnWHyZJg+HcaPByl9Tp/ubYdMT1KWk9XrgfOAoyPiykEobzfgzoiYDyDpXOA1wHPTmNmX2HSAiRMn\n2p2FMaZTLJM0LiLuApA0nl51seM9Ho0BylO+toiIwexs7gJeLWk08CSwK2mrImOM6TamAZdLuiwf\nvwGY2kF5jDEdpizla0NJnwVeCjznEiIi3tyfwiLiaklnA9eS9kr7J73qtNAY09VExMWSdgBeTdpe\n7ZMR8XCHxTLGdJCylK9ZwFnAHsDBwBRgQIZYEXEkcOTARTPGmPaSla0LOy2HMaY7KGu145iIOBlY\nGhGXRcRBpLdAY4wxvYa3GTI9TlkjX0vz5/2S3k7yybVZSXUbY4zpFirbDFW83Ve2GQIb45ueoayR\nr69JWpe0oeyngZ8BnyypbmOM6RiSNqgRRnVaro7hbYaMKc3DfcXW4THgTWXUaYwxXcK1wObAIySD\n+/VIswAPAR+OiGtqZZK0OXAGsBGwDJgeESdUpRFwArA78ARwQERc264LGRS8zZAx7R35kvQlSRs0\nOP9mSXu0UwZjjOkwFwO7R8SGETEGeBvwS+CjwEkN8j0DHB4RLybZyH5M0kuq0rwN2DqHqcCPBlv4\nQafedkLeZsj0EO2edrwR+I2kSyV9R9JnJR0haYakG4E9gavbLIMxxnSSiRHx3HZCeSu0N0TEVcBq\n9TJFxP2VUayIWAzcCmxalWwv4IxIXAWsJ2njQb+CwcTbDBnT3mnHiDgfOF/S1sBrgY2BRSRP9FMj\n4sl21m+MMV3AQkmfA36Rj98LPCJpJGk6sU8kTQC2Z+WX1U2BuwvH9+S4+wcgb3upGNUfdhgsWJC+\nr7FG5+QxpgOUZfN1O3B7GXUZY0yX8X6ST8LzSDZff81xI4H39JVZ0lrAOcAnImJR9ekaWVbaTUTS\nVLJX/XHdMr33ZOHde8ECr3g0PUVZqx2NMaZX2TwiPh4R20fEdvn7/Ih4OiLuaJQxr4o8B5gVEefW\nSHIPyZi/wmYkVz4rEBHTI2JiREwcO3bsQK5lcPCKR9PjWPkypkTsW7InOU7SvyR9VdJLm82UVzKe\nDNwaEcfVSXYB8AElXg08FhHdO+VYwSseTY9TlpNVY3oe+5bsTSLiTZI2Ik0xTpe0DnBWRHytj6yv\nBfYHbpR0XY77IjAul/tj4HckNxN3kFxNHNiGSxh8xo1LP4Ba8cb0AKWMfEn6tqR1JI3KKx8flrRf\nGXUb0y14pqV3iYgHIuL7pL1trwOOaCLP5RGhiHhFnq7cLiJ+FxE/zooXeZXjxyJiy4h4eUTMafOl\nDA5e8Wh6nLKmHd+aDUX3INkovBD4TEl1G9MVeKalN5H0YklHSboJ+AFwBb2+vdrkyTB9OowfD1L6\nnD7dQ8CmZyhr2rGylcbuwJkRsTCZMxjTO3impWc5FTiT9BK6kjF8zzJ5spUt07OUNfL1G0n/AiYC\nl0oaC/y3pLqN6Qo809KbRMSrI+IEK17GmAplKV9HAjuTPD0vJRmGvqOkuo3pCjzT0ptI2lrS2ZJu\nkfSfSui0XMaYzlGW8nVlRDwSEc8CRMTjwEUl1W1M1zB5MsydC8uWpU8rXj3BqaQ9F58B3kTaLHtG\nRyXqJux/xfQgbbX5ysurNwXWkLQ9y70xrwOMrpvRGGOGD2tExKWSFBHzgKMk/ZU0I9Db2P+K6VHa\nbXD/P8ABpJU9RSeBi0j+aowxZrjzX0kjgNsl/T/gXuB5HZapO2jkf8XKlxnGtHtj7dOB0yW9KyLO\naWddxhjTpXyCNNJ/KPBV0tTjlI5K1C3Y/4rpUcqy+XqlpPUqB5LWl9SXd2djjBnyRMQ/ImJJRNwT\nEQdGxLsi4qpOy9UV1POzYv8rZphTlvL1toh4tHIQEY+QfH4ZY8ywRNJ0SS+vc25NSQdJ6u25Nftf\nMT1KWU5WR0paLSKeApC0BrBaSXUbY0wnOAn4clbAbgLmA6sDW5MWHZ0C9PbSvopd17Rpaapx3Lik\neNneywxzylK+ZpKcq54KBHAQcHpJdRtjTOlExHXAeyStRXIwvTHwJHBrRNzWUeG6CXu6Nz1IKdOO\nEfFt4BjgxcBLga/mOGNKx26FTJlke6/ZEXFmRJxnxcsYU9bIFxFxEYPkWFXSNsBZhagtgCMi4nuD\nUb4ZvtitkDHGmE5TysiXpMWSFuXwX0nPSlrU3/Ii4raI2C4itgNeSdqu6NeDJrAZtjRyK2SMMcaU\nQSkjXxGxdvFY0t7AToNU/K7Av7PnaGMaYrdCppNkZ6trRUS/Xz6NMUOfslxNrEBEnAe8eZCK2xc4\nc5DKMm2kG2yt+nIr1A0ymuGFpJ9LWkfSmsAtwG2SPtNpuYwxnaOsacd9CuHdkr5JWvU40HJXBd4B\n/KrGuamS5kiaM3/+/IFWZQZIxdZq3jyIWG5rVbZy08itULfIaIYdL8kjXXsDvwPGAft3VqQuw289\npscoa+Rrz0L4H2AxsNcglPs24NqIeLD6RERMj4iJETFx7Nixg1CVGQgDtbUarL558mSYPh3Gjwcp\nfU6fnuLLtAfzf01PMUrSKJLydX5ELO20QF2F33pMLxIRQzYAvwAO7CvdK1/5yjCdRYpIPeuKQeo7\n78yZEaNHr5hv9OgUXyvt+PGp3PHja6dph4yt0Mr11AKYE13w+3Noup86lLSZ9u8AAeOBv3ZKnq7r\nD8ePj5o/vPHjOy2ZGQIM1f5QSfb2IOlEGkwvRsShAyh7NHA3sEVEPNYo7cSJE2POnDn9rcoMAhMm\npBfaasaPh7lzBydvtRsJSFOKlZGtdsrYCgOtR9I1ETFx8CQy7UTSCyLizsKxgK0i4vZOyNN1/eGI\nEUndqkaCZcvKl8cMKYZqf9juacc5wDWkLTV2AG7PYTvg2YEUHBFPRMSYvhQv0x0MZAu3Zlcotjpt\nWD31t/vuje3BBmua0Csue45zigf5bf0XHZKl+/Dm2qYHaavyFRGnR8TppL3M3hQRJ0bEiST3ENu1\ns27TXdSztYK+lZpm++ZWlJpaZiannw5TptSWcTBNUvxf0xtIepGkdwHrVi06OoD0QmrAm2ubnqQs\ng/tNgKKvr7VynOkhJk9O02ozZqTj/faD/ffvW6lptm9uRampN0r2u98lGZctS5/tMMT3f03PsA2w\nB7AeKy462gH4cAfl6i4arYIxZrhShmEZcCAwDzgthzuBKWUZtnWdgWkPU8vYvBk722YM6WuVPWpU\nxJgxK+drxbi+HYb4A1kYwBA1MO3VAOzcaRmKwf2hGU4M1f6wLA/3p0q6CHgVyQD/8xHxQBl1m+6i\n1ihSNbWmCSdP7vtFuHJ+2rRUxgYbwOLFsGBBii/u4zhuXG2j91qjZK2kbZZmrscMGw6WdGtEPAog\naX3g2Ig4qMNyGWM6RJke7ncCXg+8AdixxHpNF9GMUflAlZpjjkllLFgATz+94vnKdGErU3+eJjQD\n5BUVxQsgIh4Btu8rk6RTJD0k6aY653eR9Jik63I4YhBlNsa0kbI83H8TOIy0tcYtwKGSvlFG3ab9\ntLISsC/Fqr9KTUUGabkdWT3uuqs1MxObpJgBMiKPdgEgaQOa21f3NGBSH2n+GhHb5XD0AGTsDux9\n2PQKZcxtAjcAIwrHI4EbyppbtY1D+2jVYWit9BWbqlZtnxqV2YpNWT37q4HYZbUThqiNQ68G4APA\nrcBXc/gXsH+TeScAN9U5twtwYavydG1/OFDvw6YnGar9YZnTjusVvq9bYr2mjTSzErD4Mjtt2sru\nHGbMSD1tZXXhYMhQj+qRtXo7m+y2W3MrMY3pi4g4A3gX8CDwELBPRMwYpOJ3lnS9pIskvXSQyuwM\nZe7vZUyHKUv5+gbwT0mnSTqd5Hj16yXVbdpIX7616vnTOuaYFd05FGl15qFZ56QS7Lxz6ssrZR92\nWO3+/tJLV3a6Xfwf8OyIaRZJ44AlwAXA+cCSHDdQrgXGR8S2wInAeQ1kmCppjqQ58+fPH4Sq24C9\nD5teot1Da6S9zDYHNgbeQdpQe6Myh/e6dph9iFFrGq6vbdla3batP9OYI0fWrqOee4hm09bLX0/G\nQw4pZ5qSITrM3qsBuJFkenEDaYePZ4Cbm8w7gTrTjjXSzgU27Ctd1/aH3uPR9IOh2h+W1flc08mL\n7NrOpkvorw+teopMUVlq1UdWK/1vq7ZegxHGj68vY/W1tstcZah2Ng4pkJys/qTJtHWVL2AjeG5/\n3p2AuyrHjULX9oe2+TL9YKj2h2VNO14lye4lOkRximzDDVOoTJd99KPNbZ1TyxwjqqblIE3tTZmy\nfCqx1a10Wpl5qGfrNXIkjBlTu5xmkOrHH3NMfRmr28PmKqYWEXEtTbjbkXQmcCWwjaR7JH1Q0sGS\nDs5J3g3cJOl64PvAvvnPaGjiZcWmh1AZv1VJt5C22pgLPE6aioyIeEXbKwcmTpwYc+bMKaOqrqNi\nc1XPIF2qrUSNGQNrrZUUjXpORusxfnyy5apX/+jRSUH73e+Wl3/MMamPnTChdl3FMiuMGFFfAZwx\nY+V6m73W3XdPdmnVeQ8+GE46qb6MtZCSbdtgIumaiJg4uKWadiHpU4XDEaSRrzER8T+dkKeX+0Mz\n/Biq/WFZI19vA7YA3kza22yP/Gn6QbPG3rNmJSWn0UrAerr3ggUrjobVGw2qxbx5y+Wq9TI7ZUpS\nbmqNtrXi0LTRqFqteg8+uHbZJ5yw4n6OJ520ct4ZM1I8JFmabQ9vlm1I+9pWwmrAb0m2r8aYXqWs\n+U3S296hwMeBHcqcW+1aG4d+cMghjW2LikbwAzUuH2iQkrzV1LOZGjNm+bmKEX0jw/X+mIj0x6dX\nrXPNXL9tvhy6MQyJ/rBbneyZrmOo9oflVAJHkFb8fCWH64EvlXWRQ6KzaYKZMxsbsK+5Zu1znVbA\nqvvNZpXCZpSXweijGylx9c6NGVNb5pEjvdrRIQXgNyT3EjVDp+Tq+v7QhvemBYZqf1hWJ3QrsHrh\neA3g1rIucqCdTbe8hNUbMRrsMGLE4KavXqnYynUU8xZH9ZoZGRtouzZa2ThmTOf+H4ZqZ9NrAXhj\nDicAZ5FMLfYEfg58vVNydb3yZZcTpgWGan9Yls3XXGD1wvFqwL9LqntA1POA3qxTzeKeg6uskj6b\ndcpZvUqxFaP3gdCqgfjmmye7qHrMm7fi9day62qUt3pVJsCzzy4/P1DP841WWNY7t3ChF2aZxkTE\nZRFxGbB9RLw3In6Tw/uB13Vavq7FzlZNL1CGhkfyvHwvaaPYU4F7gF+Qlkd/v931D+RNr78vYTNn\n1p+aqkzHFUduqkfXDjmkfB9W/Q2VqcVG04nVo0LV19uorVodIRvMe9xolK7evWv36BdD9E2vVwNp\n5H+LwvELKHHkvzp45MsMJ4Zqf1hW5zOlUWh3/QPpbFpxEtrI43ujMGpUxKqrtp6vW0KlT6y1GKAY\nRo5szXi+1dAfQ/t6dTey+err3rV7+nGodja9GoBJJAeos3OYC7y1U/J0vfJlmy/TAkO1P+y4AGWE\n/nQ2zShS1avlunmkqrKSsKJ8DFa5tUa0Wknfapv3p+xm+vJmVju2Iks7X9KHamfTy4FkarFtDqt1\nUpauV74iusfQ1nQ9Q7U/LMXJaqdpxangrFlps+UFC5ore/ToZOszbVp5NlkVRoxozj6rImPRHqkV\nR6FFJ6QbbJDiFi5c0Tlqkb7KruUwtZX8jahVdiuOWxtRz6lrLdrhXHV52UPTqWCvImkUcAjwhhw1\nm7S90NJOyGMnq2Y4MVT7w7IM7ocEH/0o7L9/84oXJAem++9fvuI1enTjP/e+DMFbMXpfuHC5E9KH\nH06h4pC0loF5X2X3ZTfbimzNlD1Y9rutOEzdYIPmHOGanuBHwCuBk3J4ZY4zxvQoVr4ys2bBj3/c\n/MhGkbIHD0eOXL7SrhaVEZ1GClItD/D19kNs1Ut7peyRI/tXXiV/LXlGj4aZM+tfe62yW91fsh61\nlMJRo2DVVVeOW7y4/ytkzbBjx4iYEhF/yuFAmtjb0RgzfGmr8iXpN5IuqBfaWXcrVLbhaZcSJaVp\nu8Fg9Oi0Nc/kya1txVOLyZNXVNJOOGFg5VWXffrp/S9v8uQ0wlZRtKpH8Vq59oG2U1GmaoX11FPh\nlFNWjFtnHXj66RXzepPtnuZZSVtWDiRtATzbQXmMMZ2mnQZltNHJILAecDbwL9JS7p3rpW1kYNpu\nQ/miO4KB1lPL7nSw7VK7vbz+ll2m/W4rK2T7A0PUwLRXA7Ary1c7XkZa7fimTskzJAzuI2x0b5pi\nqPaHZXU+f2kmrsUyT2Pe+CsAACAASURBVAc+lL+vCqxXL229zmbmzOWe0tuhdNWqr9KXjBlTezug\nTrgu6AaGSz/b6JkarBWQQ7Wz6cVAml14DWm14yvwasfmsLsJ0yRDtT8sy+ZrbB5qB0DSC4Cx/S1M\n0jqklUMnA0TE0xHxaCtlVDzXP9tg8F+CXXddPqU0Zkx9u6giq65ae0qrOM338MOwZMnK02q1prGG\nu+f0ge4i0C00eqb6O31rhjYRsQw4NiKeiogbIuL6iHiq03J1PdOmpbn6Ip67N8OIUlxNSJoETAf+\nk6MmAB+JiN/3s7ztcnm3kN4krwEOi4jHa6WvtbS6L3cGI0cut62qplHeMWOS7dRwVpYGm8FyBdFp\n6l1Ho2epPwzVpdW9iqSvADcA50YZHW4fDAlXE/X8urTTh4sZkgzV/rCUka+IuBjYGjgsh236q3hl\nVgF2AH4UEdsDjwOfLyaQNFXSHElz5s+fv1IBjdwMFI3aa1HPgHvmzDSiZcWrNYbLVm715F22zM9E\nj/Mp4FfA05IWSVosaVGnhepqBmuJsjFdSinKl6TRwGeA/xcR1wPjJO0xgCLvAe6JiKvz8dkkZew5\nImJ6REyMiIljx648w1nvN1xx49Doz7LWqrfhPjXYToZLPztcrsMMLhGxdkSMiIhREbFOPl6n03J1\nNYO1RNmYLqUsm69TgaeBnfPxPcDX+ltYRDwA3C1pmxy1K2kKsmnq/babnR6qdtNgxav/DJd+tt51\n7L67Ha72OpL2kXScpGMl7d1peboev+GaYc4qJdWzZUS8V9L7ACLiSUkaYJkfB2ZJWpVkS3ZgK5kr\nv+Fp09J0Ub2tckz7GS73otZ17L57UugrtsOVxQTF9GZ4I+kkYCvgzBx1sKS3RMTHOihW9zN5sn8k\nZthSlsH9FaTRqb9FxA7Z4eCZEbFT2ytniBiYmmHJhhvW3q5qIIsJhqqBaa8i6WbgZRVje0kjgBsj\n4qWdkMf9oRlODNX+sKxpxyOBi4HNJc0CLgU+W1LdxnSEWbPq7xM61BYTmAFxG1C0/NuctPrRGNOj\nlLXa8Q/APsABpKH3iRExu4y6jekUjVwS2Qi/pxgD3CpptqTZJPvUsd22zVrXMmuWjSbNsKMUmy9J\nrwWui4jfStoP+KKkEyKigactY4Y2jUa3htpiAjMgjui0AEOWiudiG02aYUZZBvc/AraVtC3J5cQp\nwBmkfR+NGZaMG1fb6eqYMf7f6CUi4rJOyzBkaeTp3j8iM4Qpy+brmWxsuhfw/Yg4AVi7pLqN6Qj1\nXE+ccEJn5DFmyDFcPDAbU0VZytdiSV8A9gN+K2kkMKqkuo3pCHZVZAaCpFMkPSTppjrnJen7ku6Q\ndIOkHWqlG9LYc7EZppSlfL0XeAr4YHaQuinwnZLqNqZj2BlvbyNppKSZ/cx+GjCpwfm3kbZt2xqY\nSjLvGF4MFw/MxlRR1mrHByLiuIj4az6+KyLOKKNuY4zpFBHxLGll46r9yPsXYGGDJHsBZ0TiKmA9\nSRv3U9TuxMPHZphS1mrHVwMnAi8GVgVGAksiYt0y6jfGmA4yF/hbdivxeCUyIo4bYLmbAncXju/J\ncfcPsNzuwp7uzTCkrNWOPwD2BX4FTAQ+QBoqN8aY4c59OYxgcBca1dqireaWJZKmkqYmGWd7KWM6\nTlnKFxFxh6T/3969x81R1Xke/3zzcCdADIkuQ0iCOwyKNyRZBkUdbsuCOOAIKr6eYFjZjaAM6DjD\n4D6Oi0rc8Y4XQIMgmSQDCAoGh+EictkdFJNAIISbEQNGEJJwJy/J7bd/nNOm0+l+LqS7qi/f9+tV\nr66qrq7zq3q6z3Pq1Klz+nI1/A/ykENmZl0tIj7Xol2vIPWWXzGBVMirF8MsYBak4YVaFI+ZDVNR\nDe7X5DYPiyV9WdIngZ0LStvMrDSSxkv6iqTrJP28MjVh1/OBD+enHg8CnouI7rrlWM093VsXKarw\ndVJO63RSm4e9gOMLStvMrEzzgAeBvYHPkdqALRjqQ5IuA34B7CtphaRTJJ0q6dS8yXXAI8Ay4CLg\nYy2IvT1Uerp/9FGI2NTTvQtg1qGU+j7tblOnTo2FCxeWHYZZU0haFBFTy47Dhif/vaZIujci3pzX\n3RYRpYzw0ZH54eTJ9YeLmDQp9eFiPatT88Mix3Y8B5hUnWZEvLaI9M3MSrQuvz4h6RhSu6wJJcbT\nedzTvXWZohrcXwx8ElgEbCgoTTOzdnCupN2AT5G63NmVlB/acDUaKNVPblqHKqrw9VxE/HtBaZmZ\ntY2I+GmefQ44tMxYOtbMmamNV/Ug2+7p3jpYSwtfVWON3SLpK8CPScMMARARd7UyfTOzskj6Ng36\n3QKIiDMKDKezVTpZHRhItxonTkwFL3e+ah2q1TVfX6tZrm4UF8BhLU7frG3Mm+f/HT2mw1q1t7na\nAtjAwObrzTpISwtfEeEqdjM2PSlfuWtSeVIe/L+jW0XE7LJj6Cr+EVkXKaSfL0lflDSmavlVks4t\nIm2zdjAwsHlzFUjLlYt36z6Szsuv10qaXzuVHV/H8Y/IukhRnaweHRHPVhYi4hng3QWlbVa6wZ6U\nd8fdXWtOfv0qqQlG7WQj4e4mrIsU9bRjn6TtI+JlAEk7AtsXlLZZ6Ro9KT92rO+kdKuIWJRfbys7\nlq7g7iasixRV8zUXuDkPj/ER4CbA7SGsZ8ycmZ6Mr1ZZ9p2U7ibpPZLulvS0pOclvSDp+bLj6jiN\nfkTubsI6UCGFr4j4MnAu8HrgDcAX8jqzntDfD7NmpdFQpPQ6axY8/XT97X0npaucB0wHdo+IXSNi\nl4jYteygOk6jH5GriK0DtXxsR0l9wA0RcURLExpER45lZj3hlQxZ16ljmfUqSbcAh0fExrJjAeeH\n1l06NT9seZuviNggaY2k3SLiuWbtV9Jy4AXScEXrO/Hkm7nj7p5wFnCdpNvYvJPpr5cXkpmVqagG\n938Elki6CXipsrIJPTwfGhGrtnIfZqVxx909YSbwIrADsF3JsZhZGyiq8PVveTKzGv39Lmx1ubER\ncWTZQXQVDxdhHa6QwleLenoO4EZJAXwvIma1IA0zs631M0lHRsSNZQfSFdzTvXWBQgpfkn5LnQFm\nI+K1W7HbgyPicUmvBm6S9GBE3F6V5gxgBsBE9wNjZuX5OHCWpJeBdYCA8BOPr1Cjnu6nT0/zLoBZ\nByjqtmN1Y/gdgPcDY7dmhxHxeH59StLVwIHA7VXvzwJmQXq6Z2vSMjN7pSJil7Jj6CqN+mHZsME1\nYNYxiurna3XV9PuIOA847JXuT9LOknapzANHAvc1KVwzs60m6XX59YB6U9nxdazB7mSsWQNnnllc\nLGavUFG3HaszmlGkmrCtuRp8DXC1JEjH8K8Rcf1W7M/MrNn+jtT0od44jsFWXID2tHr9s1RbvTq1\nC3Ptl7Wxom47Vmc+64HlwAde6c4i4hHgLVsZk5lZy0TEjPx6aNmxdJVKoWr69HSrsZ6BARe+rK0V\n9bSjMx8z60mS3g9cHxEvSPoMcABpiLW7Sw6tc1UKVtOm1X/f43NZmyukzZek3SV9S9JdkhZJ+qak\n3YtI28ysZP+UC17vAP4bMBv4bskxdb7+fti9wb8RP+Fuba6QwhdwObASOB44Ic9fUVDaZmZlqtwb\nOwa4MCJ+gnu6b45vfjONx1XrxRdTuy+zNlVU4WtsRHwhIn6bp3OBMQWlbWZWpt9L+h6pnet1kran\nuLy3u/X3w6xZW9aArV4NJ50EH/tYOXGZDaGoDOAWSSdKGpWnD+DhhsysN3wAuAE4KiKeJfVx+A/l\nhtRF+vth9Ogt10fAd7/rGjBrS0UVvj4K/CvwMrCWdBvy7yS9IOn5gmIwMytcRKyJiB9HxK/z8hPD\nHWpI0lGSHpK0TNLZdd4/WdJKSYvz9D+aHX9HaNTAPiI9FekCmLWZop52dA/PZmYjIKkPOB/4r8AK\nYIGk+RFxf82mV0TE6YUH2E4mTkxjPNbjnu+tDRXe7kDSOUWnaWbWgQ4ElkXEIxFRuWNwXMkxtaeZ\nMyF1ul3fmjWp7y+zNlFGo89jS0jTzKzT7An8rmp5RV5X63hJ90q6StJexYTWZvr74dRTBy+Aue8v\nayNlFL4G+XWYmVlWL6+MmuVrgckR8WbgZ6Q+xLbckTRD0kJJC1euXNnkMNvEBRfAnDnQ11f//QgY\nN87tv6wtlFH48oCyZmZDWwFU12RNAB6v3iAiVkfEy3nxImBKvR1FxKyImBoRU8ePH9+SYNtCfz/M\nnl2/7y9IXVB85CMugFnpiurhfoKkqyWtBP4g6UeSJhSRtplZh1oA7CNpb0nbAScC86s3kLRH1eKx\nwAMFxteeKn1/NaoBW7vW7b+sdEXVfP2AlGnsQWqzcG1eZ2ZmdUTEeuB0Uh9hDwA/jIilkj4vqdJ2\n9gxJSyXdA5wBnFxOtG2mvx82bmz8/qOPpvZhkye7FsxKUUhXE8D4iKgubF0q6RMFpW1m1pEi4jrg\nupp1n62a/zTw6aLj6giDdT9R8eij7obCSlFUzdcqSdMk9eVpGrC6oLTNzKzXzJwJ22479HZr1sBH\nP5pqwUaNcm2YFaKowtdHSENs/AF4gjS49kcKStvMzHpNfz/84AdbjvtYz0svpVqwiPR60km+LWkt\nVUjhKyIei4hjI2J8RLw6It4bEUPUB5uZmW2F/n5YtQomTRrZ5yL36FG5LekCmDVZUU87zpY0pmr5\nVZIuKSJtMzPrcTNnNu5+YijuHd9aoKjbjm+OiGcrCxHxDPDWgtI2M7NeVul+YqQ1YBXuHd+arKjC\n1yhJr6osSBpLcU9amplZr+vvh+XLYe7ckdeCjR3rBvnWVEUVvr4G3CHpC5I+D9wBfLmgtM3MzJJK\nLdhwGuJDemLyhRfcIN+aqqgG9/8CHA88CawE3hcRc4pI28zMbDP9/TB69PC23bAh9YpfrbpB/rRp\nHjPSRqywsR0j4v6I+E5EfDsi7i8qXTMzsy0Mtx3XYD3lV6xe7dowG5EyBtY2MzMr18SJzd2fu6ew\nEXDhy8zMek+97iek5uzb3VPYEDq28JWHKbpb0k/LjsXMzDpMdfcTUnqdM+eVd0dR69FHXftlDXVy\ndw9nAg8Au5YdiJmZdaD+/voDas+YkWqvtpYH7bYGOrLmS9IE4Bjg+2XHYmZmXaRSI9YMa9bAmWc2\nZ1/WVTqy8AWcB5wFDOMxFDMzsxHo7x/69uNw24etXu3bj7aFjit8SXoP8FRELBpiuxmSFkpauHLl\nyoKiMzOzrjBYg/xJkzY93Tgc06a5CwrbTMcVvoCDgWMlLQcuBw6TNLd2o4iYFRFTI2Lq+PHji47R\nzMw6WaMG+RFpmKKRNsx3FxRWpeMKXxHx6YiYEBGTgROBn0fEtJLDMjOzblMZD3LjxvRa3XC+Xs3Y\nUNasSZ2xjhuXCnTbbOOOWXtUxxW+zMzMSlevZuy004YukEWkdmCQhi4CjxfZgzq5qwki4lbg1pLD\nMDOzXlSvq4qDD05tvEaqtof8yv6tK7nmy8zMrFmG86TkUCpdVEyeDKNGuTasC7nwZWZm1kyvpD1Y\nrdWrUy1YRHqdNi21FXMhrCu48GVmZtZM1e3BoHljRq5e7Scmu4QLX2ZmZs1WeVIyInVRsfvuzdmv\ne83vCi58mZmZtVJ/P6xaBXPnjvzpyHpWr077qEx9ffWflJw3b1O7sXHj0jRUG7Lqz7itWcsoRtJL\nb4eaOnVqLFy4sOwwzJpC0qKImFp2HNaZnB+2mXnzYGAgtetqpp13hnXrYO3a+u/vtFO6NVr9ROW8\neVsOKl5vuzbSqfmha77MzNqUpKMkPSRpmaSz67y/vaQr8vt3SppcfJS2VSq3J+fO3fpG+tVeeqlx\nwQtSAWtgYPOarunTNy94Vbb76EddG9ZkLnyZlcg1/NaIpD7gfOBoYD/gQ5L2q9nsFOCZiPhz4BvA\nl4qN0pqm0ki/r6+4NCtPUVaeqqx0+lrrpZe2fPKy9pbnqFEjX1fv1mm9z3Rh5ujCl1lJKjX81Xma\nH2SyKgcCyyLikYhYSxrL9riabY4DZuf5q4DDpWY9WmeF6++H2bObWwPWahs3ptfqJkzDXTfc/XRh\n5ujCl1lJBgbq1/APDJQTj7WdPYHfVS2vyOvqbhMR64HngCY9VmelaDRsUbOeluxUXZY5uvBlVpLH\nHhvZeus59WqwaqsNhrMNkmZIWihp4cqVK5sSnLVQ7YDeF1yw+dOS0Ly+wzpJF2WOLnyZlWTixJGt\nt56zAtirankC8HijbSRtA+wGPF27o4iYFRFTI2Lq+PHjWxSutVx132EbN6bXyjR3buPasW4pqHVR\n5ujCl1lJ6o1AstNOab0ZsADYR9LekrYDTgTm12wzH5ie508Afh690H+QbanSl1ilIFZ923LOnOY/\nTVm0Lssctyk7ALNeVek2Z2Ag1aZPnJjyljbtTscKFhHrJZ0O3AD0AZdExFJJnwcWRsR84GJgjqRl\npBqvE8uL2NpGf3/jjKTSp1hfX3q6sfJaqTV7+ulNmVFl+8ceg7Fj03Klg9dKGX/UqFQL90rWVRvs\nM5MmdV3m6E5WzTpMp3YqaO3B+aF1k07ND33b0czMzKxALnyZmZmZFciFLzMzM7MCufBlZmZmViAX\nvszMzMwK5MKXmZmZWYF6oqsJSSuBRwfZZBywqqBwHEN7x1B2+sOJYVJEuJtye0U6JD8cimNsjm6I\nsSPzw54ofA1F0sKy+wlxDO0RQ9npt0sM1rs64fvnGJvDMZbHtx3NzMzMCuTCl5mZmVmBXPhKZpUd\nAI6houwYyk4f2iMG612d8P1zjM3hGEviNl9mZmZmBXLNl5mZmVmBer7wJekoSQ9JWibp7ILS3EvS\nLZIekLRU0pl5/VhJN0n6dX59VYvj6JN0t6Sf5uW9Jd2Z079C0nYtTn+MpKskPZjPxdtKOAefzH+D\n+yRdJmmHVp8HSZdIekrSfVXr6h63km/l7+e9kg5oZixm1crID4cySH55jqTfS1qcp3eXHOdySUty\nLAvzukLzsyHi27fqXC2W9LykT5R9Hns1P+zpwpekPuB84GhgP+BDkvYrIOn1wKci4vXAQcDHc7pn\nAzdHxD7AzXm5lc4EHqha/hLwjZz+M8ApLU7/m8D1EfE64C05lsLOgaQ9gTOAqRHxRqAPOJHWn4dL\ngaNq1jU67qOBffI0A7iwybGYAaXmh0NplF9C+p3un6frygvxTw7NsVS6Rig6T28oIh6qnCtgCrAG\nuDq/XeZ5vJQezA97uvAFHAgsi4hHImItcDlwXKsTjYgnIuKuPP8CqdCxZ057dt5sNvDeVsUgaQJw\nDPD9vCzgMOCqgtLfFXgXcDFARKyNiGcp8Bxk2wA7StoG2Al4ghafh4i4HXi6ZnWj4z4O+JdIfgmM\nkbRHM+Mxy0rJD4cySH7ZCYrOz4brcOA3ETFYZ7uF6NX8sNcLX3sCv6taXkHBP2pJk4G3AncCr4mI\nJyBlOMCrW5j0ecBZwMa8vDvwbESsz8utPhevBVYCP8i3Pr8vaWcKPAcR8Xvgq8BjpELXc8Aiij0P\nFY2Ou/TvqPWMtv+u1eSXAKfn20+XlHlLLwvgRkmLJM3I64rM00fiROCyquV2Oo/QA/lhrxe+VGdd\nYY9/ShoN/Aj4REQ8X2C67wGeiohF1avrbNrKc7ENcABwYUS8FXiJgqvkcyZzHLA38GfAzqRq7Vpl\nPhJc6nfUekpbf9fq5JcXAv8Z2J908fS1EsMDODgiDiDlIR+X9K6S46krt2E9Frgyr2q38ziYtv6O\njkSvF75WAHtVLU8AHi8iYUnbkjKSeRHx47z6yUoVan59qkXJHwwcK2k56dbCYaSasDH59hu0/lys\nAFZEROUK9ipSYayocwBwBPDbiFgZEeuAHwNvp9jzUNHouEv7jlrPadvvWr38MiKejIgNEbERuIh0\n27Q0EfF4fn2K1JbqQIrNz4braOCuiHgS2u88Zl2fH/Z64WsBsE9+um07UlXs/FYnmttXXQw8EBFf\nr3prPjA9z08HftKK9CPi0xExISImk4755xHRD9wCnNDq9HMMfwB+J2nfvOpw4H4KOgfZY8BBknbK\nf5NKDIWdhyqNjns+8OH8lM9BwHOV6nizJislPxxKo/yypq3P3wD31X62KJJ2lrRLZR44MsdTZH42\nXB+i6pZjO53HKt2fH0ZET0/Au4GHgd8AAwWl+Q5SVem9wOI8vZvU7upm4Nf5dWwBsRwC/DTPvxb4\nFbCMVCW9fYvT3h9YmM/DNcCrij4HwOeAB0kZzhxg+1afB1LG9wSwjnQld0qj4yZVs5+fv59LSE9m\ntvw76qk3pzLyw2HE1Ci/nJN/E/eS/invUWKMrwXuydPSyrkrI08fIs6dgNXAblXrSj2PvZofuod7\nMzMzswL1+m1HMzMzs0K58GVmZmZWIBe+zMzMzArkwpeZmZlZgVz4MjMzMyuQC19dRtKlkk4YesuW\nx3GrpKlDb7nV6SyXNG4E258s6TutjMnM2oPzwyG3d35YEhe+bFBVPb2bmfU054fWLC58tbncc/K/\nSbpH0n2SPpjXf1bSgrxuVu4FuvazUyTdlgd6vaFquIYzJN2fB1K9vM7nTpZ0paRrSQPFjpZ0s6S7\nJC2RdFzebrKkByRdJGmppBsl7Vizr1GSZks6t046/1wVx1fzutdIujof7z2S3p7XX5OPY2nVoLW1\n+5sm6VeSFkv6nqS+vP6/S3pY0m2koZXMrAM5P3R+2DXK7uXV0+ATcDxwUdXybvl1bNW6OcBf5/lL\nSUPjbAvcAYzP6z8IXJLnHyf32g6MqZPmyaSehiu9Cm8D7Jrnx5F6fhcwGVgP7J/f+yEwLc/fChxE\n6r14i56ygbHAQ/Cnjn7H5NcrSAPnAvTVHi+wI6k3+t3z8vIc0+uBa4Ft8/oLgA8De5CGERoPbAf8\nB/Cdsv+unjx5Gvnk/ND5YbdMrvlqf0uAIyR9SdI7I+K5vP5QSXdKWkIaGPsNNZ/bF3gjcJOkxcBn\nSIOQQhpGYp6kaaTMop6bIuLpPC/gi5LuBX4G7Am8Jr/324hYnOcXkTKgiu8B90XEzDr7fx74I/B9\nSe8D1uT1hwEXAkQa7LVyvGdIugf4JWlg1X1q9nc4MAVYkI/3cNKQH38J3Bpp8Oy1pMzMzDqT88PE\n+WGHc+GrzUXEw6Qf0RLg/+Tq9R1IVzInRMSbSCPR71DzUQFLI2L/PL0pIo7M7x1DGh9rCrBI9dsx\nvFQ130+6UpoSEfsDT1al93LVdhtIV4UVd5AyxdrYiIj1wIHAj4D3Atc3OgeSDgGOAN4WEW8B7m5w\nvLOrjnffiDinklyjfZtZ53B+6PywW7jw1eYk/RmwJiLmAl8FDmDTD22VpNGkavVaDwHjJb0t72db\nSW+QNArYKyJuAc4CxgCjhwhjN+CpiFgn6VBg0jDDvxi4DriyNkPLce8WEdcBnyANsg1pENXT8jZ9\nknbN6T8TEWskvY5UfV/rZuAESa/Onx0raRJwJ3CIpN0lbQu8f5ixm1mbcX7o/LBb+MmN9vcm4CuS\nNpJGfT8tIp6VdBHp6m85sKD2QxGxVukR629J2o30tz4PeBiYm9cJ+EZEPDtEDPOAayUtBBYDDw43\n+Ij4ek5rjqT+iNiY39oF+Em+ChTwybz+TGCWpFNIV46nka4CT83V/A+Rqtpr07lf0mdIDWJHkc7V\nxyPil5LOAX4BPAHcRWo7YWadx/mh88OuUGncZ2ZmZmYF8G1HMzMzswK58GVmZmZWIBe+zMzMzArk\nwpeZmZlZgVz4MjMzMyuQC19mZmZmBXLhy8zMzKxALnyZmZmZFciFLzMzM7MCufBlZmZmVqCeKXxJ\nGpC0VNK9khZL+sshtr80jwVWKkm3Spo6xDZ7S7pT0q8lXSFpu6Li2xrDObYR7u8QSW9v8N7rJP1C\n0suS/r7mvaMkPSRpmaSzq9Z35HltBUn/q+wYrHmcH7Yf54edoxn5YU8UvvJI9u8BDoiINwNHAL8r\nOIZWDmL+JdKAsPsAzwCntDCtdnYIUDezAZ4GzgC+Wr1SUh9wPnA0sB/wIUn75bd9Xjdx4atLOD/s\nGYfg/LBVXPgapj2AVRHxMkBErIqIxwEkfVbSAkn3SZolSbUfljRF0m2SFkm6QdIeef0Zku7PV4+X\n1/ncyZKulHQtaXT50ZJulnSXpCWSjsvbTZb0gKSL8tXojZJ2rNnXKEmzJZ1bs17AYcBVedVs4L11\nYjknf/5GScslvU/Sl3Mc10vadohj/Z/5PN0j6UeSdsrrL5X0LUl3SHqkcnUsaQ9Jt+er6vskvXOw\nP5CkI/OV2F35nI0e7O9Te+4lTQZOBT6Z09wsvYh4KiIWAOtqkj4QWBYRj0TEWuBy4LhOPq85ji/m\n87lQ0gE5zd9IOjVvI0lfyftYIumDjfYv6Z+BHfO6eYP9Ha0jOD9sw99tTXzOD7s9P4yIrp+A0cBi\n4GHgAuCvqt4bWzU/B/jrPH8pcAKwLXAHMD6v/yBwSZ5/HNg+z4+pk+7JwIpKGsA2wK55fhywDBAw\nGVgP7J/f+yEwLc/fChwEXAYM1EljHOnHUlneC7ivznbnAP8vH89bgDXA0fm9q0k/pMGOdfeqfZ0L\n/G3VebqSVJDfrxIL8KlKvEAfsEudmG4FpuZjuB3YOa//R+CzQ/x9tjj3+Rj/fojvwmbb5L/x96uW\nTwK+0+HndTlwWp7/BnAvsAswHngqrz8euCnv4zXAY6R/ynX3D7xY9u/YU3MmnB+26+/2Vpwf9kx+\n2Mqq37YRES9KmgK8EzgUuELS2RFxKXCopLOAnYCxwFLg2qqP7wu8EbgpX2T0AU/k9+4F5km6Brim\nQfI3RcTTeV7AFyW9C9gI7En6QwP8NiIW5/lFpAyo4nvADyNiZp39b3FlCkSDWP49ItZJWpKP4/q8\nfklOb7BjfWO+yhxDyrxvqNrvNRGxEbhfUuV4FgCX5Cuda6qOrZ6DSD+o/8jpbgf8Ir/X6O8znHM/\nHI3OX6ef1/lVuzrirQAAAtVJREFUMYyOiBeAFyT9UdIY4B3AZRGxAXhS0m3AfxnB/q1DOT/8k3b8\n3YLzw57ID3vltiMRsSEibo2I/w2cDhwvaQfSld8JEfEm4CJgh5qPClgaEfvn6U0RcWR+7xjS/fEp\nwCLVb8fwUtV8P6m0PSUi9geerErv5artNsBmBeM7SD+62tgAVgFjqtKeQLoKqqdym2EjsC5yEZ6U\n8W0zxLFeCpyez9Pn2Pw8VceunMbtwLuA3wNzJH24QUyVz9xUle5+EXHKEH+f4Zz74VhBuoqrqJy/\nTj+vlc9urNlPdUxbGOHfzTqU88NNabTZ77byGeeHXZ4f9kThS9K+kvapWrU/8Cib/rCrlO6p13ua\n5yFgvFIjVSRtK+kNkkYBe0XELcBZbCqpD2Y3UjXnOkmHApOGeQgXA9cBV9b+qPIX+5aq2KcDPxnm\nfmvVPdb83i7AE/kKoH+oHUmaRDrWi3L8Bwyy+S+BgyX9ef7sTpL+ggZ/n0HO/Qs5zpFYAOyj9CTP\ndsCJwPwuOa+DuR34oKQ+SeNJGcyvBtn/uhyjdTjnh8Pm/ND5Ycvyw5647Uj6In47Vy+uJ7UtmBER\nz0q6iFQVuZz0xdtMRKxVatz3LUm7kc7ZeaT2EnPzOpGeAnl2iDjmAddKWkhqc/HgcA8gIr6e05oj\nqT9fVVT8I3B5rq69m/QlGbFBjnUp8E/AnaRMeglD/6gPAf5B0jrgRaDhFUNErJR0MnCZpO3z6s9E\nxMMN/j591Dn3Sg15r1JquPu3EfF/K2lI+k/AQmBXYKOkTwD7RcTzkk4nVW/3kdoeLM0f6+jzOoSr\ngbcB95BuH5wVEX+QNL3B/mcB90q6KyKGzBStrTk/HF4azg+dH7YsP9SmGkEzMzMza7WeuO1oZmZm\n1i5c+DIzMzMrkAtfZmZmZgVy4cvMzMysQC58mZmZmRXIhS8zMzOzArnwZWZmZlYgF77MzMzMCvT/\nAba6nnSG/s56AAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x1ce58431be0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "f, (ax1, ax2) = plt.subplots(1, 2, sharex=False, sharey=False, figsize=(10,5))\n",
    "ax1.plot(summ, 'bo')\n",
    "ax1.set_xlabel(\"sales rank scaled\")\n",
    "ax1.set_ylabel(\"co-purchased products (avg count)\")\n",
    "ax1.set_title(\"Sales Rank relationship to co-purchasing pairs\")\n",
    "ax1.annotate('Sales rank 0 means least 100 means most', (0,0), (0, -40), xycoords='axes fraction', textcoords='offset points', va='top')\n",
    "ax2.plot(summ1, 'ro')\n",
    "ax2.set_xlabel(\"sales rank scaled\")\n",
    "ax2.set_ylabel(\"similar products (avg count)\")\n",
    "ax2.set_title(\"\"\"Sales Rank relationship to similar products\"\"\")\n",
    "plt.subplots_adjust(left=0.2, wspace=0.8, top=0.8)\n",
    "plt.suptitle(\"\"\"Sales Rank relationships \\n Amazon co-purchases data \\n\\n\"\"\", fontsize=16)\n",
    "ax2.annotate('Sales rank 0 means least 100 means most', (0,0), (0, -40), xycoords='axes fraction', textcoords='offset points', va='top')\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 300,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAmsAAAF0CAYAAAB8JH43AAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAIABJREFUeJzs3Xd8nXX5//HXO0n3XukupYMuKAVK\ny6YDAREoCF/ZCg5ERQVRERRl+tWfiqJ8BSoIAgVERtnLDsrqpC0UOih0piPp3iPJ9fvjc6ccTs9J\nTtKcnJPkej4e9yPn3td9586dz/lMmRnOOeeccy475WQ6AOecc845l5wn1pxzzjnnspgn1pxzzjnn\nspgn1pxzzjnnspgn1pxzzjnnspgn1pxzzjnnspgn1pzLUpIul2Qx01ZJcyVdLSmvBs7/kKSlaTp2\nT0k3S+qVjuNXVTqvuaZIGhHd25y45T2j5+jyDIXmnKsiT6w5l/3+BzgWOA+YDvwN+HVGIzpwPYHf\nAFmVWANuA87NdBAHaATh3sa/31cTnqOXajog59yBSfu3c+fcAZtjZoujz69L6gNcQ5IEmyQBDcxs\nT00FmAmSGpnZ7uo8ppl9Wp3Hqw6ScgGZWfGBHCe6V1OrJyrnXE3ynDXnap8ZQAtJ+QCSlkp6VNI3\nJS0A9gBfidZ1lvSwpHWSdkv6QNKl8QeUNFrS+5J2SfpU0ncTbDMiKkYbEbe8rLi2Z9zy70TH3Clp\no6Q3JR0X7T8p2uyNmGLeLxw37liTJb0t6SxJsyXtBr4frcuTdIOkBdE1rpL0J0mNo/WNJG2Q9KcE\nx70gOveQaH6/YlBJTSX9XtISSXuin78sK2aUlCtpk6RfxexzWHTct+OOtVLS/0t2ndE2JukOSb+Q\ntITw+zxMUmNJf5Y0T9I2SWskvSCpf8y+NxNy1QD2lt3baN1+xaDR9a6UdISktyTtkPSJpKsSxHVK\ndO93SVos6dvx9yv6XdwWPUO7oufubUknlHfNzrnyec6ac7XPwUAJsC1m2UhgCHALUAgsldQMeBNo\nA9wIrAAuBR6R1NTMxgJIGgC8DMwELgQaATcDzaPzVJqkPwLXAQ8QEg+lwDFAj+hcPwD+D/gRIfEJ\n8HEFhz0E+CuhqPIzYEO0/FHgLOD3wLvAgGibnsB5ZrZb0pPAxZJ+bmax13QpMM/M5iS5jjzgNWBg\ndMwPo+u4CWgLXGdmJZKmAKOA26NdRwE7gWGSmpnZdkn9gK58nlAtz+XRNf4U2A6sIvxeWkTnWB2d\n//vAVEn9zWwNcD/QDfgWcAKp/f5aAo8BfwFuBa4A7pG00MwmRfdhIKH4dDrhGWkY3YNWhN9tmeuB\na4FfAnOiYw+NYnXOVZWZ+eSTT1k4Ef5hG9CP8MWqDfBdwj/g8THbLQV2AJ3i9r862n9E3PL/EhJ0\nudH8OGAd0Cxmm+6EHJ2lMctGJDleWZw9o/k+UYx3lnNtZcc6JcV7MZmQKBgSt/zE6Dhfj1t+SbR8\nSDR/fDR/Wsw2HYC9wM9jlj0Ud82XRfudFHf8X0b3Jz+av5aQOGsUzY8H7iEkqE+Lll0Vna95Bddq\nhMRZkwq2ywWaAluBa2OW3xwdIy9u+57R8svjrteAkTHLGkXPw9iYZY8BRUDTmGWdgV1x9+tF4JlM\n/+345FNdm7wY1Lnst4DwT34D8HdC4uqbcdtMtZCzEuskoMDMJsctf5SQUBkYzR8LvGxm28s2MLMV\nwDtVjPcUQhWLsVXcP5mltn8O2OmERNPTURFcXpQb9nq0/iQAM3sH+JSQ+CpzYRTnuHLOeTqwDHg3\nwfEbEHLZIOSWNQaOi4pHTybkyL1DyGUj+jnDzGJzRJN51cx2xi+U9DVJ0yRtAooJuW7NCQn6qtph\nUQ4a7Kvb9gkhF7TMMYRnZEfMdqsJOZmxZgBnRMW4J0hqeABxOeciXgzqXPY7F1hJyEFZZma7Emyz\nOsGytkmWr4lZDyGHZG2C7dYSilwrq130c2UV9i1PomvJJxTJJUsAtYv5/CjwU0nNowTTZcBEMyso\n55z5wEGExHJ5x58LrCcUR28hFP+9CfQHvipJhNzEf5Rzrlj7Xauks4B/A/8iFHevI+Q2vkxIKFbV\nxgTLdscdszMhNzbeWr7Yove3hNy2SwlF79skPQX8zMzWHUCMztVrnlhzLvvNs89bgyZjCZZtIHGO\nS6fo5/ro52qgY4Lt4peVJRLjc0vaxc2X/VPuCixMcNyqSnSN66O4Tkyyz6qYz48Q6s+dK2kacDTw\njQrOuR5YAnwtyfqlAGZmkt4k5J5tJbTg3ShpIqGO2fGE3MxU6qtB4mu9EFhsZpeXLZDUgJqpD7aa\nkHCN94VnxMz2EuoO/l5SJ+BM4E5Cce0F6Q7SubrKi0Gdq7veBLpJOj5u+cWEXJL50fx7hKKrZmUb\nSOpOSGDEWhb9PDRu+Rlx8/8l5PhcWU5sZV1uNClnm1S8SsgBamVmMxNM+xJrFrrleI+Qo3YZoQjx\nmRSO3x3YluT4sblFk4BhhATKxGjZrOg8NxOKa6tatAwhwRPffcdlhLprsarr3saaSnhGmpYtkNSZ\n/Z+RfcxsjZndT3ge4p8Z51wleM6ac3XXQ8CPgWck/ZJQLHkJ8CXgu/Z5q8jbCR3vvi7pD4Scs1uI\nKxo1s9VR7tENktYREnyXAr3jtvtU0p+Bn0hqATxPaHAwDFhgZv8GFhESHt+UtIGQwFhoZlsrc4Fm\nNlnS48BTku4ktFYsJVSmPwO43swWxezyMKEV6mHAsynUHxtHaB05Ier6Yy7h/vQGzgbOianHNZFQ\nj+0kQu4S9nlL0TOBKYnqoVXCq8A50b19ETiK0Jp2U9x2Za1qr5P0ClBiZjMP4LwQnpHzgdeilr6N\nCK1B1xLTGlTSc4R79D6hePUIQr2/+w7w/M7Va56z5lwdFTUYOJlQGf53wHPA4cBlFnXbEW03n5Cw\naUqoE/U7QjcOExIc9lJCLstfCYnB5XzeXUXsuX9K6FbiGOBpQqJnZLQ9Zrae0Fr1cEIO4AxC4qMq\nLiXkXJ0fXeNT0bE/Yf+6eP8mJBI7EYpFyxUV651GqGt2JaF+2DhC8em7hNyysm0/js5XDLwVc5iy\nXLZUi0CT+QdwB6E48QVCX3pnAZvjtnuR0BDl+4ScxBkcoOjavkLoOuRJwjNyNyHnMPb8U4BTCV22\nvAp8D/h/wM8PNAbn6jOZJaoa4ZxzziUnqTmwGHjJzL6V6Xicq8u8GNQ551yFJP2NkJu4CuhCKGJv\nA9yVybicqw88seaccy4VjQl18ToSin+nEzo1/iCjUTlXD3gxqHPOOedcFvMGBs4555xzWcwTa845\n55xzWcwTa84555xzWcwTa84555xzWcwTaxki6RJJr2c6DgBJN0t69AD2/0jSiGoMKf74IyQlHRRc\n0r2SbkrX+atC0o2S7q/ivl94NiSZpD7VF13VSOohaZuk+OGNXD3k77BKHb/WvcOyWba8E2uSd92R\nIklLCU3WS4BthN65r05huBok9SQMBt3AzIoBzGwcoSf0WkXSQ8BKM/tV2TIzG5S5iMDMrqrqvpIm\nA49GYxhWGzP77QHsm5XPhpktB5pnOg5XNf4OC/wd5mojz1mrnLPMrDkwhDDm3Q0ZjqdCkjxBXk/V\n5O9egb9Psp+/w1zW89/5/vzlWgVmtgZ4jfDCA0DSVyTNlrRF0gpJN8fsMiX6uSkqRjpW0uWS3o7Z\n3yRdJekTSRsl/Z8kRetyJf1J0jpJSyRdHW2f8IGWtFTS9ZI+ALZLypPURdLTkoqiY/wo2fVJ+o+k\nNZI2S5oiaVC0/ErCQOA/j67jhZjznRJ9biTpL5JWRdNfJDWK1o2QtFLSdZIKJa2WdEXMec+Q9LGk\nrZIKJP00Lq5k+z0k6fa4c9wY3a+lki5Jcp13ACcCd0fXc3e0/DhJM6LrnyHpuHLu1fVRrFslLZQ0\nOlq+r1hGUs/o93VF9GxsjH7XR0v6QNKmsnNH23/h2Yg7X9LnLOY835K0nM/HpIzdv9z7k+Lx86L5\nyZLukPQOsAPoFcX+WXQ/liS79y6z/B3m77CYY3SX9Ex0X9fHHCNH0q8kLYtiflhSq3KOM1nS/0qa\nHp33OUltY68pbvvYe36zpKckPSppC3B59MzcKOnT6H7OktQ95hCnJHnWekuaGF3LOknjJLWOOW+y\nd3aOpF9E51sv6cmy+LOCmfmUwgQsJfTWDdAN+BC4K2b9COAwQgJ4MGFA53OidT0BA/Jitr8ceDtm\n3ggDMLcGegBFwOnRuquAj6PztgH+G3+8BLHOAboDTaKYZgG/BhoCvYDPgNOi7W8mZKOX7f9NwoDN\njQgDes+JWfcQcHs59+ZWwkDf+UAHwvA0t8Xco+JomwaEwcN3AG2i9auBE6PPbYAjU9xvX0wx294Z\nxX8ysB3ol+ReTQa+HTPfFtgIXEaoJnBRNN8uwb79gBVAl5jfc+/4exrz+7+X0Av8qcAuYHx0n7oC\nhcDJ5TwbfSrxnD0MNAOaJIi53PuT4vHzYu7dcmBQdK9aAVtijtUZGJTpv12f/B2Gv8OSvcNygbnA\nnwnvjMbACTH3cHF0r5sDzwCPlPN8TQYKgEOjYz3N5+/AEYSi52T3/GZgL3BO9LtuAvyM8Iz2AwQc\nXnYNlP+s9QG+FN27DoQvGn+J1pX3zr4m+r13i/a9D3g803+3++5XpgOoLVP0YG0DtkYPygSgdTnb\n/wX4c8wDkcqL7oSY+SeBX0SfJwLfjVl3SvzxEsT6zZj54cDyuG1uAB6MPt9MzIsubrvW0blaRfMP\nUf6L7lPgjJh1pwFLo88jgJ1x96EQOCb6vBz4LtAy7vgV7bcvJj5/0TWLu5c3Jbm+yXzxRXcZMD1u\nm/eAyxPs2yeK4xRCXZ7Ydfvuaczvv2vM+vXABTHzTwPXlPNs9KnEc9arnOeysvcn6XMc3btbY7Zt\nBmwCziNBQtGnzE74O8zfYfvveywhobPf7yF6Pr4fM9+PkKBK9jubDPwuZn4gYViyXFJLrE2JW78Q\nGJPkXEmftQTbngPMjj6X986eD4yOme9c3vXW9OTFoJVzjpm1IDx4/YH2ZSskDZc0KcpK3kz4Jtk+\n8WGSWhPzeQefV+buQvg2UCb2czKx2xwEdFEobtskaRNwI6Gy8RdEWc+/i7KCtxD+oCD1a+kCLIuZ\nXxYtK7PeogrKkdjrPI/wjXOZpDclHZvifvE2mtn2cmKoTPxl+3eN39DMFhO+jd0MFEp6QlJ551kb\n83lngvkKK++n+JxV9HwkvT9VeI73nSs65gXRPqslvSSpf0XX5GqUv8MqVm/eYYScy2VxcSU7zjJC\nTl1Hhdar26LpxphtVsRt34DU73v8M9GdkHBOJuGzJik/ehcXRL//R8tiqOCdfRDwbMzzNZ/QGGe/\nZywTPLFWBWb2JuGb0B9jFj8GPA90N7NWhCIvle1ygKdcTciaLdM92YaxYcZ8XgEsMbPWMVMLMzsj\nwX4XA2MI3zxaEb5RQ+rXsorw0JfpES2rOGCzGWY2hlD8MJ7wbakq2khqlmIM8dcTH3/Z/gUJdzZ7\nzMxOiPYxwkDX6VTec7YvrAqOUd79SeX4Sc9lZq+Z2ZcI30oXAP+oIBaXAf4OK1d9eoetAHoocd3B\nRPehGFhrZleZWfNoim353j1u+73AOkIxbtOyFQrd/3So4DpWAL0TxFWR/42ONdjMWgKXEvMOK+ed\nvQL4ctwz1tjMEr77a5on1qruL8CXJJVV0G0BbDCzXZKGEV4YZYqAUkLZf1U8CfxYUteoouT1ldx/\nOrAlqljZJPrmeaikoxNs2wLYTSimawrEd0GxlvKv43HgV5I6SGpPqGNSYf9Hkhoq9NvUysz2Euo+\nlVR8aUndEh3zROBM4D9Jtou/npeBQyRdrFCp+QJCdv6LCWLuJ2mUQuXjXYTcsQOJORXlPWeVkez+\nVPn4kjpKOjv6J7ObUOSW7vvhqs7fYYnVm3cY4b6uBn4nqZmkxpKOj9Y9Dlwr6WBJzQn38d9JcuHK\nXCppoKSmhPp5T5lZCbAIaKzQiKUB8CtCvbDy3A/cJqmvgsGS2lWwD4Tf/zZCY5iuhLpvQIXv7HuB\nOyQdFG3bQdKYFM5XIzyxVkVmVkSoyF3WkeH3gVslbSX8cT8Zs+0O4A7gnSiL9ZhKnu4fwOvAB8Bs\nwh9jMSm+CKI/lrMILb+WEL7p3E/41hnvYUL2dQGhQvDUuPUPAAOj6xifYP/bgZlRrB8C70fLUnEZ\nsDTKur6K8I2oKtYQKtSuIvQDdZWZLUiy7V3A+Qotiv5qZusJL8brCC/7nwNnmtm6BPs2An5HuJ9r\nCN+mb0ywXXVK+pxVQnn350COn0O4b6uADYSK0d+vQnyuBvg7zN9hMfe1D6G+3UpCVQaAfwKPECro\nLyEkbn5YQdyPEHJs1xAaK/woOs9mwvN1P+H3sj06V3nuJDyDrxMSvg8QGh5U5BbgSGAz8BKhYUSZ\n8t7ZdxFyll+P/gamEupKZgVFFelcLSLpy8C9Zhaf1V3vKfRC/qiZdato2/rI74/LBv4OS662/o3K\nO+dNK89ZqwWibP8zoiztrsBvgGczHZdzzqXC32HOHRhPrNUOImTtbiQUIcwnFFM451xt4O8w5w6A\nF4M655xzzmUxz1lzzjnnnMtinlhzzjnnnMtidWpk+/bt21vPnj0zHYZzrobMmjVrnZnFd65ZK/n7\ny7n6J9V3WJ1KrPXs2ZOZM2dmOgznXA2RFD+sTq3l7y/n6p9U32FeDOqcc845l8U8seacc845l8U8\nseacc845l8U8seacc845l8U8seacc845l8U8seacc845l8U8seacc845l8U8seacc7XFuHHQsyfk\n5ISf48ZlOiLnXA2oU53iOudcnTVuHFx5JezYEeaXLQvzAJdckrm4nHNp5zlrzrmUmRmTFxaya29J\npkOpf375y88TamV27AjLnXN1mifWnHMpe37uKi5/cAaPTq0zozzVHsuXV265c67O8MSacy4lm3fu\n5bYX5wPw3/lrMxxNPdSjR+WWO+fqjLQl1iQ1ljRd0lxJH0m6JcE2jST9W9JiSdMk9YxZd0O0fKGk\n09IVp3MuNX96fSEbtu9mZL8OzFi6kc0792Y6pPrljjugadMvLmvaNCx3ztVp6cxZ2w2MMrPDgSHA\n6ZKOidvmW8BGM+sD/Bn4PYCkgcCFwCDgdODvknLTGKtzrhwfrNzEI1OX8fVje3L1qD6UlBpTFhVl\nOqz65ZJLYOxYOOggkMLPsWO9cYFz9UDaEmsWbItmG0STxW02BvhX9PkpYLQkRcufMLPdZrYEWAwM\nS1eszrnkSkqNXz47j/bNG/GTUw9hSPc2tGnagIkLCjMdWv1zySWwdCmUloafnlBzrl5Ia501SbmS\n5gCFwBtmNi1uk67ACgAzKwY2A+1il0dWRsucczXs0anL+LBgMzedOZCWjRuQmyNG9stn0sJCSkrj\nv38555yrbmlNrJlZiZkNAboBwyQdGreJEu1WzvL9SLpS0kxJM4uKvFjGuepUuGUXf3xtISf2bc9Z\ngzvvWz5qQD6bduxl9vKNGYwucyS1lvSUpAWS5ks6Nm79CEmbJc2Jpl9nKlbnXO1XI61BzWwTMJlQ\n/yzWSqA7gKQ8oBWwIXZ5pBuwKsmxx5rZUDMb2qFDh2qO3Ln67baX5rO7pJRbxxxKqKEQnNi3A3k5\nYkL9LQq9C3jVzPoDhwPzE2zzlpkNiaZbazY851xdks7WoB0ktY4+NwFOARbEbfY88I3o8/nARDOz\naPmFUWvRg4G+wPR0xeqc299bnxTxwtxVfO/k3hzcvtkX1rVq0oCje7Zl4vz6l1iT1BI4CXgAwMz2\nRF9InXMuLdKZs9YZmCTpA2AGoc7ai5JulXR2tM0DQDtJi4GfAL8AMLOPgCeBj4FXgR+YmXeZ7lwN\n2bW3hF8/9xE92zXleyN6J9xm9IB8Fq7dyooNOxKur8N6AUXAg5JmS7pfUrME2x0bdV30iqRBNRyj\nc64OSWdr0A/M7AgzG2xmh5YVA5jZr83s+ejzLjP7HzPrY2bDzOyzmP3vMLPeZtbPzF5JV5zOuf3d\n9+ZnLFm3ndvOOZTGDRL3mjOqfz4AkxbWu9y1POBI4B4zOwLYTvRFM8b7wEFR10V/A8YnOpDXuXXO\npcJHMHDOfcHSddv5v8mLOXNwZ07sm7weaK8OzTm4fTMm1L+i0JXAypjW7U8REm/7mNmWsq6LzOxl\noIGk9vEH8jq3zrlUeGLNObePmXHTc/NomJvDTWcOrHD7Uf3zee/T9WzfXVwD0WUHM1sDrJDUL1o0\nmlBlYx9JnaI+I5E0jPCuXV+jgTrn6gxPrDnn9nnpw9W89ck6fnrqIXRs2bjC7Uf3z2dPSSnvLF5X\nA9FllR8C46I6uUOA30q6StJV0frzgXmS5gJ/BS6MGk8551yl5WU6AOdcdti6ay+3vvAxh3ZtyWXH\n9kxpn6E929KiUR4TFxRy6qBO6Q0wi5jZHGBo3OJ7Y9bfDdxdo0E55+osz1lzzgHwp9cXUbRtN3ec\ncxi5OYn6pd5fw7wcTjqkAxMXFFLqoxk451xaeGLNOce8gs08/N5SLh1+EId3b12pfUf1z6dw624+\nWrUlPcE551w954k15+q5MFD7h7Rt1oifntav4h3ijOjXAQkmLFibhuicc855Ys25eu6x6cuZu3Iz\nv/rKAFo1aVDp/ds1b8QR3Vszsf4OPeWcc2nliTXn6rGirbv5f68u4Lje7RgzpEuVjzN6QEc+WLmZ\nwi27qjE655xz4Ik15+q13748n917S7ntnC8O1F5Z9Xg0A+ecSztPrDlXT727eB3Pzi7guyf3oneH\n5gd0rP6dWtClVeP6OJqBc86lnSfWnKuHdheX8Kvn5tGjbVN+MLLPAR9PEqMG5PP24nXs2ltSDRE6\n55wr44k15+qhf0z5jM+KtnPrmEFJB2qvrNH9O7JjTwnTlmyoluM555wLPLHmXD2zfP0O/jZxMWcc\n1okR/fKr7bjH9m5H4wY5TJzvXXg451x18sSac/WImfHr5+eRlyN+feagaj124wa5nNCnPRMWFOLD\nYDrnXPXxxJpz9cir89YweWER137pEDq1qnig9soa1b8jKzfuZHHhtmo/tnPO1VeeWHOunti2u5hb\nXviYAZ1bcvlxPdNyjrIuPCZ4B7nOOVdtPLHmXD3x5zcWsXbrLu4491DyctPzp9+pVWMGdWnJRO/C\nwznnqo0n1pzLgE+LtnHyHyZxzROzmbSgkL0lpWk938ertvDQu0u58OgeHNmjTVrPNbp/PjOXbWDT\njj1pPY9zztUXnlhzLgMefncpqzbtZNLCIq54aAbD7vgvv3z2Q6Yv2UBpafVWzi8tNX41/kNaN2nA\n9adXfqD2yho1oCOlBm8uKkr7uZxzrj7Iy3QAztU3O/eU8MzsAs44rDN/OP9wpiwq4vm5q3jm/QLG\nTVtOl1aNOevwLpw9pAsDO7c8oGGgAP49cwXvL9/En/7ncFo3bVhNV5Hc4K6taN+8IRPmFzJmSNe0\nn8855+o6T6w5V8Ne/nA1W3cVc9GwHjTMy+GUgR05ZWBHduwp5o2P1/L8nFU88PYS7pvyGb07NGPM\nkK6cfXgXerZvVulzrdu2m9+9soDhB7flq0fWTMIpJ0eM7JfPax+tobikNG3145xzrr7wxJpzNezx\n6cvp1b4Zww9u+4XlTRvmMWZIV8YM6crG7Xt4Zd4anptTwJ//u4g731jE4d1acfaQrpw1uDP5LVPr\nduN/X17A9t3F3H6AA7VX1ugB+fxn1kpmLdvI8F7tauy8zjlXF6UtsSapO/Aw0AkoBcaa2V1x2/wM\nuCQmlgFABzPbIGkpsBUoAYrNbGi6YnWupixau5WZyzZy4xn9y008tWnWkIuH9+Di4T1YvXknL85d\nzXNzC7jtxY+5/aWPObZXO8YM6cLpgzrTqmmDhMeY+tl6nn5/Jd8f0Zu+HVuk65ISOqFvBxrkiokL\nCj2x5pxzByidOWvFwHVm9r6kFsAsSW+Y2cdlG5jZH4A/AEg6C7jWzGIHFhxpZuvSGKNzNeqJ6Sto\nkCvOO7Jbyvt0btWE75zUi++c1ItPi7bx/JxVPD93Fdc//SE3jf+Ik/t1YMyQLozu35EmDcM4n3uK\nS/nV+Hl0a9OEH47qm67LSap5ozyO6dWOCQsKueGMATV+fuecq0vSllgzs9XA6ujzVknzga7Ax0l2\nuQh4PF3xOJdpu/aW8MzslZw6qBPtmjeq0jF6d2jOtV86hGtO6cuHBZt5fs4qXvhgFW98vJZmDXM5\ndVAnzh7ShXkrN7O4cBsPfGPovgRcTRvVP59bXviYZeu3c1C7yte3c845F9RInTVJPYEjgGlJ1jcF\nTgeujllswOuSDLjPzMamOUzn0uq1j9awacdeLh7W44CPJYnB3VozuFtrbjhjANOXbOD5uQW8/OEa\nnp1dAMCpAzsyekDHAz5XVZUl1iYuKOSK4w/OWBzJSBoKnAh0AXYC84D/xuXuO+dcxqU9sSapOfA0\ncI2ZbUmy2VnAO3EvyePNbJWkfOANSQvMbEqC418JXAnQo8eB/xN0Ll0em7acHm2bcmw11+HKzRHH\n9m7Hsb3bccvZhzJlURHvfrqeq07uVa3nqayD2jWjT37zrEusSboc+BGwBJgFLAQaAycA10uaB9xk\nZsszFqRzzsVIa2JNUgNCQm2cmT1TzqYXElcEamarop+Fkp4FhgH7JdaiHLexAEOHDq3e3kSdqyaf\nFm1j2pIN/Pz0fuTkpK9VZmxXINlgdP98/vnOErbtLqZ5o6xpfN6M8GVwZ6KVkoYAfQFPrDnnskLa\nOkBSaOr2ADDfzO4sZ7tWwMnAczHLmkWNEpDUDDiVUEThXK307xkryMsR5x+VesOCumBU/3z2lhhv\nf5I9oxmY2f+Z2U5Jx8evk3S8mc0xswmZiM055xJJZ2+VxwOXAaMkzYmmMyRdJemqmO3OBV43s+0x\nyzoCb0uaC0wHXjKzV9MYq3Nps7u4hKdmreSUAR3Jb5Fa/2h1xVEHtaFl4zwmZOfA7n9LcZlzzmVU\nOluDvg1UWN5jZg8BD8Ut+ww4PC2BOVfDXv9oLRu27+Gi4fWvTmVebg4j+uUzaWEhpaWW1iLgVEk6\nFjgO6CDpJzGrWgKZaTrrnHNKkX9/AAAgAElEQVTl8HFgnEuzJ2Ysp2vrJpzYp32mQ8mI0QPyWbdt\nDx8UbM50KGUaAs0JX1ZbxExbgPMzGJdzziWUNTV+nauLlq3fzjuL13Pdlw7JilylTDj5kA7kCCbO\nX8uQ7q0zHQ5m9ibwpqSHzGxZpuNxzrmKeM6ac2n0xIwV5OaI/xnaPdOhZEzrpg0ZelBbJizIunpr\njSSNlfS6pIllUyo7Smot6SlJCyTNj4pWE213tKQSSZ5j55yrMs9Zcy5N9hSX8p+ZKxjZL59OrepX\nw4J4owbk87tXFrBm865suhf/Ae4F7ieMQVwZdwGvmtn5khoCTeM3kJQL/B547UADdc7Vb56z5lya\nTJi/lnXb9nDx8Pqbq1ZmdP98ACZmV+5asZndY2bTzWxW2VTRTpJaAicRuibCzPaY2aYEm/6Q0M9k\nVl20c6728cSac2ny+IwVdG7VmJMPyc90KBnXJ7853ds2YeKCtZkOJdYLkr4vqbOktmVTCvv1AoqA\nByXNlnR/1B/kPpK6ErolujcNcTvn6hlPrDmXBis27OCtT4r42tDu5NbThgWxJDG6f0feXryOXXsr\nW+KYNt8Afga8Sxh2ahYwM4X98oAjgXvM7AhgO/CLuG3+AlxvZuVerKQrJc2UNLOoKHs6DnbOZRdP\nrDmXBv+esQIBXzvai0DLjOqfz669pbz36fpMhwKAmR2cYEplQNWVwEozmxbNP0VIvMUaCjwhaSmh\nO5C/SzonQQxjzWyomQ3t0KHDAVyNc64u8wYGzlWz4pJSnpy5gpMP6UDX1k0yHU7WGN6rLU0b5jJh\nwVpG9s980bCkrydabmYPl7efma2RtEJSPzNbCIwGPo7bZt/I9ZIeAl40s/EHHrVzrj7yxJpz1Wzi\ngkIKt+7m9mH1b8SC8jTKy+XEvu2ZOL8QG2OE4YMz6uiYz40Jia73gXITa5EfAuOilqCfAVeUDaNn\nZl5PzTlXrTyx5lw1e2LGCvJbNGJUFuQeZZvR/Tvy2kdrWbBmKwM6t8xoLGb2w9h5Sa2AR1Lcdw6h\nqDNWwkSamV1elficc65MhXXWJOVIOkLSVySNktSxJgJzrjYq2LSTyQsL+drQ7uTlepXQeCP6h3pZ\nWdaFR5kdQN9MB+Gcc/GS5qxJ6g1cD5wCfEJoqt4YOETSDuA+4F9mVloTgTpXGzw5YwUGXOANCxLK\nb9GYw7u1YsL8tfxgZJ+MxiLpBcCi2VxgAPBk5iJyzrnEyisGvR24B/iumVnsCkn5wMXAZcC/0hee\nc7VHSanx5MwVnNi3A93b7tehvYuM6t+Rv0xYxPptu2nXvFEmQ/ljzOdiYJmZrcxUMM45l0zSchoz\nu8jMpgANE6zebGZ/MTNPqDkXeXNRIas37+Iiz1Ur1+gB+ZjB5IWZ7VcsGtB9AdACaAPsyWhAzjmX\nRCqVat5LcZlz9dpj01bQvnkjThno1TrLM6hLSzq2bJTxemuSvgZMB/4H+BowzQdcd85lo/LqrHUC\nugJNJB0BlLWzb0mCQYudq8/WbN7FpIWFfOfEXjTwhgXlksSo/vm8OHc1e4pLaZiXsfv1S+BoMyuM\n4uoA/JfQya1zzmWN8uqsnQZcDnQD7oxZvhW4MY0xOVfr/GfmCkpKjQu9CDQlo/p35PHpK5i5dAPH\n9WmfqTByyhJqkfX4qC7OuSyUNLEW1Uf7l6TzzOzpGozJuVqltNR4YsYKju/Tjp7tm1W8g+P4Pu1o\nmJfDhAWFmUysvSrpNeDxaP4C4JVMBeOcc8mk0inui5IuBnrGbm9mt6YrKOdqk7cWr6Ng005+8eX+\nmQ6l1mjaMI/jerdj4oJCbjpzYEZiMLOfSfoqcAKhmsdYM3s2I8E451w5Usnyfw4YQ2javj1mcs4B\nj09bTttmDTl1kDcsqIzR/fNZsm47nxVty8j5JR0MvGxmPzGzawk5bT0zEoxzzpUjlZy1bmZ2etoj\nca4WKty6i//OX8sVx/ekUV5upsOpVUb2z4fnPmLigkJ6dWieiRD+AxwXM18SLTs68ebOOZcZqeSs\nvSvpsMoeWFJ3SZMkzZf0kaQfJ9hmhKTNkuZE069j1p0uaaGkxZJ+UdnzO1cTnpq1kuJS40IftL3S\nurVpSv9OLZgwP2NdeOSZ2b6+1aLPifqVdM65jEolsXYCMCtKOH0g6UNJH6SwXzFwnZkNAI4BfiAp\nUeWUt8xsSDTdCiApF/g/4MvAQOCiJPs6lzGlpcYT01cw/OC29M5MzlCtN6p/PjOWbmDzzr2ZOH2R\npLPLZiSNAdZlIhDnnCtPKom1LxMGNz4VOAs4M/pZLjNbbWbvR5+3AvMJ/balYhiw2Mw+i77tPkGo\nN+dc1njvs/Us37CDizxXrcpGD8inuNR465OMjGZwFXCjpOWSlhPGQr4yE4E451x5UkmsWZIpZVGl\n3SOAaQlWHytprqRXJA2KlnUFVsRss5LUE3rO1YjHpi+nVZMGnH5op0yHUmsN6d6GNk0bMDEDRaFm\n9qmZHUPIvR9kZseZ2ac1HohzzlUglQYGLxESZwIaAwcDC4FB5e1URlJz4GngGjPbErf6feAgM9sm\n6QxgPCEXT+wvYQJR0pVE34Z79PAcDlcz1m/bzesfreGyY3rSuIE3LKiq3Bwxsl8+kxYWUlJq5OYk\n+tNPLzPLTHNU55xLUYU5a2Z2mJkNjn72JRRRvp3KwSU1ICTUxpnZMwmOvaXsRWlmLwMNJLUn5KTF\ndgXfDViVJL6xZjbUzIZ26NAhlbCcO2BPv7+SvSXGRcN8xIIDNWpAPht37GXOio2ZDsU557JSpYdW\nieqhVdi0XZKAB4D5ZnZnkm06RdshaVgUz3pgBtBX0sGSGgIXAs9XNlbn0sEsNCwYelAb+nZskelw\nar0T+3YgL0eZbBXqnHNZrcJiUEk/iZnNAY4EUqkNfDxwGfChpDnRshuBHgBmdi9wPvA9ScXATuBC\nMzOgWNLVwGtALvBPM/sotUtyLr2mLdnAZ+u28/2RfTIdSp3QqkkDhvZsw8QFhfz89JobBSIavSDe\nZuDDuDFDnXMuo1KpsxabdVBMqMNW4VihZvY2ieuexW5zN3B3knUvAy+nEJ9zNerx6ctp0TiPrxzW\nOdOh1Bmj+3fkjpfns3LjDrq1aVpTp/0WcCwwKZofAUwFDpF0q5k9UlOBOOdceSpMrJnZLQCSWoRZ\nr4zr6q+N2/fwyrw1XHR0d5o09IYF1WXUgHzueHk+kxYUctmxPWvqtKXAADNbCyCpI3APMByYAnhi\nzTmXFSqssybpUEmzgXnAR5JmSTo0/aE5l32emV3AnuJSH7GgmvVq34ye7ZoyYUGNlj72LEuoRQqB\nQ8xsA5CRXnqdcy6RVIpBxwI/MbNJEIaIipYdV95OztU1Zsbj05czpHtrBnRumelw6hRJjOrfkUen\nLWPHnmKaNkzl1XTA3pL0ImE8UIDzgCmSmgGbaiIA55xLRSqtQZuVJdQAzGwy0CxtETmXpWYt28ji\nwm3eXUeajB6Qz57iUt5ZvL6mTvkD4EFgCKHT7oeBH5jZdjMbWVNBOOdcRVL5+vqZpJv4vP7GpcCS\n9IXkXHZ6bPpymjfK48zBXTIdSp10dM+2DOzckp17S2rqlNcA/zGzChtMOedcJqWSWPsmcAtQ1qnt\nFOCKtEXkXBbavGMvL32wmvOP6kazRjVSRFfvNMzL4eUfn1iTp2wJvCZpA2H84afi6rA551xWSKU1\n6EbgRzUQi3NZa/ycAnYXl/qg7XVI1NL9FkmDgQuANyWtNLNTMhyac859QSqtQd+Q1Dpmvo2k19Ib\nlnPZo6xhwWFdW3Fo11aZDsdVv0JgDWH0lPwMx+Kcc/tJpYFBezPb1zIqymnzF5qrN+as2MSCNVs9\nV62OkfQ9SZOBCUB74DtmNjizUTnn3P5SSayVStr3X0rSQYClLyTnssvj05fTtGEuZw/xhgV1zEHA\nNWY2yMx+Y2Yfp7qjpNaSnpK0QNJ8ScfGrR8j6QNJcyTNlHRCtUfvnKs3Uqkp/UvgbUlvRvMnAVem\nLyTnssfWXXt5Ye5qxgzpQnNvWFCnmNkvACTlA41jli9PYfe7gFfN7HxJDYH4MbImAM+bmUV14p4E\nam7gU+dcnZJKA4NXJR0JHEMY6/NaM1uX9sicywLPzVnFzr0lPmJBHSTpLOBOoAuh3tpBwHxgUAX7\ntSR8ab0cwMz2AHtit4kblq8ZXhrhnDsAqRSDYmbrzOxFM3vBE2quvjAzHpu2nAGdW3J4N29YUAfd\nTvgSusjMDgZGA++ksF8voAh4UNJsSfdHox58gaRzJS0AXiJ0geScc1WSUmLNufpmxYYd/Pbl+Xy8\negsXD+uOpEyH5KrfXjNbD+RIyolGahmSwn55wJHAPWZ2BLAd+EX8Rmb2rJn1B84Bbkt0IElXRnXa\nZhYVFVX5QpxzdZtXwnEuUlxSyqSFRYybtow3FxUh4IzDOnHeUd0yHZpLj02SmhM6+h4nqRAoTmG/\nlcBKM5sWzT9FgsRaGTObIqm3pPbxJRNmNpYw1jJDhw71olLnXEIVJtYktU2weKuZ7U1DPM7VuLVb\ndvHE9BU8MWM5qzfvomPLRvxoVF8uHNadzq2aZDo8lz5jgJ3AtcAlQCvg1op2MrM1klZI6mdmCwnF\np19oSSqpD/Bp1MDgSKAhoR8355yrtFRy1t4HugMbCQ0MWgOro2+h3zGzWWmMz7m0KC013vl0HeOm\nLueN+WspKTVO7Nue35w1iNED8mmQ6zUE6ipJsmB7tKgU+Feibco5zA8JuXENgc+AKyRdBWBm9wLn\nAV+XtJeQILygguM551xSqSTWXgWeNbPXACSdCpxOaIr+d2B4+sJzrnpt2L6Hp2at4LFpy1m6fgdt\nmjbg2ycczEXDetCz/X51xF3dNEnS08Bzsd10RAmvE4BvAJOAh5IdwMzmAEPjFt8bs/73wO+rMWbn\nXD2WSmJtqJldVTZjZq9L+q2Z/URSozTG5ly1MDNmLdvIo1OX8fKHa9hTUsrRPdtw7ZcO4fRDO9Eo\nLzfTIbqadTqhdebjkg4GNgFNCA2uXgf+HCXGnHMuK6SSWNsg6XrgiWj+AmCjpFxC8YFzWWnrrr08\nO7uAcVOXs3DtVlo0yuOiYd25ePhB9OvUItPhuQwxs12EUoG/S2pAGGpqZ+ywes45l01SSaxdDPwG\nGE+os/ZWtCwX+Fr6QnOuauYVbGbctGU8N2cVO/aUcGjXlvzuq4dx9pAuNG3oDaDd56KGUqszHYdz\nzpUnlf9c3c3sh0nWLa7OYJyrqp17Snjhg1WMm7qMuSs307hBDmMO78olx/RgcLfWmQ7POeecq7JU\nEmt3SuoM/Ad4wsw+SnNMzqVsx55i/vDaQp6atZKtu4rpm9+cm88ayLlHdqNVkwaZDs8555w7YKmM\nDTpSUidCkefYaFy8f5vZ7eXtJ6k78DDQiVC3bayZ3RW3zSXA9dHsNuB7ZjY3WrcU2AqUAMVmFt/y\nyjn++fYSHnxnKWcf3oVLhvdg2MFtfbQBl5JoiKidZlYq6RDCQOuveB+Szrlsk+rYoGvM7K/AVcAc\n4Ncp7FYMXGdmAwjj7/1A0sC4bZYAJ5vZYMJwLGPj1o80syGeUHOJmBnPzi5g2MFt+etFRzC8VztP\nqLnKmAI0ltQVmABcQTnddTjnXKZUmFiTNEDSzZLmAXcD7wIVjr9jZqvN7P3o81ZgPtA1bpt3zWxj\nNDs1leM6V+ajVVv4tGg75x7RteKNndufzGwH8FXgb2Z2LhD/hdI55zIulTprDwKPA6ea2aqqnERS\nT+AIYFo5m30LeCVm3oDXJRlwXzSGnnP7PDu7gIa5OZxxaOdMh+JqJ0k6ljDU1LeiZd5c2DmXdVKp\ns3bMgZwgGij5aeAaM9uSZJuRhJflCTGLjzezVZLygTckLTCzKQn2vRK4EqBHjx4HEqqrRYpLSnl+\n7ipG9u9Aq6bekMBVyY+BGwgjtHwkqRdh5ALnnMsqqQzk3hf4X0LxQOOy5WbWK4V9GxASauPM7Jkk\n2wwG7ge+bGb7Bjouy8Uzs0JJzwLDCHVMviDKcRsLMHToUB97r55499P1FG3d7UWg7kB0NLOzy2bM\n7DNJb2UyIOecSySVBgYPAvcQGgyMJLTwfKSinRRqej8AzDezO5Ns0wN4BrjMzBbFLG8mqUXZZ+BU\nYF4Ksbp6YvzsAlo2zmNEv/xMh+JqrxtSXOaccxmVSv2MJmY2QZLMbBlwc/Tt8zcV7Hc8cBnwoaSy\ncfZuBHoAmNm9hFal7QjDvsDnXXR0BJ6NluUBj5nZq5W7NFdX7dhTzGsfreHsIV1o3MDH9XSVI+nL\nwBlAV0l/jVnVkvCl1DnnskoqibVdknKATyRdDRQAFWZnmNnbhOGpytvm28C3Eyz/DDg8hdhcPfTG\nx2vZvqeEMUO8CNRVySpgJnA2MCtm+Vbg2oxE5Jxz5UglsXYN0BT4EaEvtJHAN9IZlHPlGT+7gC6t\nGjOsZ9tMh+Jqoajj7blRXdjtZlYCICkXaJTR4JxzLoFUWoPOiD5uI3Qa6VzGrNu2mymfrOPKk3qR\nk+Md4LoD8jpwCuHdBtAkWnZcxiJyzrkEkjYwkDRW0mFJ1jWT9M1ouCjnasyLc1dRUmreCtRVh8Zm\nVpZQI/rcNIPxOOdcQuXlrP0duClKsM0Dighdd/QlVMT9JzAu7RE6F2P8nFUM7NySQzq2yHQorvbb\nLunIspFWJB0F7MxwTM45t5+kiTUzmwN8LerUdijQmfAim29mC2soPuf2WbJuO3NWbOLGM/pnOhRX\nN1wD/EdS2cgsnYELMhiPc84llEqdtW3A5PSH4lz5xs8uQIKzD/ciUHfgzGyGpP5AP0LL9QVmtjfD\nYTnn3H58HDxXK5gZ4+cUcFzvdnRq1bjiHZyrgKSvxy06QhJm9nBGAnLOuSQ8seZqhTkrNrFs/Q6u\nHtkn06G4uuPomM+NgdHA+4RRWpxzLmtUKrEWdY7bPNmA7M6ly/jZBTTKy+H0QztlOhRXR5jZD2Pn\nJbUihaH0nHOuplU4NqikxyS1jMbo/BhYKOln6Q/NuWBvSSkvfLCaUwZ2pEXjBpkOx9VdOwit3Z1z\nLqukkrM20My2RH2qvQxcTxii5Q9pjcy5yFufFLFh+x7O9eGlXDWS9AJg0WwOMBB4MnMROedcYqkk\n1hpIagCcA9xtZnujAdadqxHPzl5Fm6YNOOmQDpkOxdUtf4z5XAwsM7OVmQrGOeeSSSWxdh+wFJgL\nTJF0ELA5nUE5V2bb7mLe+HgN5x/VjYZ5FZbaO5cyM3sz0zE451wqUkmsvWBmfy2bkbQc+Gb6QnLu\nc6/NW8OuvaU+vJSrNpK28nnx537MrGUNhuOccxVKJbH2NHBk2YyZmaQngKPSFpVzkfFzCujetglH\n9miT6VBcHWFmLQAk3QqsIbQAFXAJ4OOYOeeyTtLEWtSz9yCglaSvxqxqSeiTyLm0Ktyyi3cWr+Pq\nkX3wepIuDU4zs+Ex8/dImgb8v4p2lNQauB84lJBL900zey9m/SWExlgA24DvmdncaovcOVevlJez\n1g84E2gNnBWzfCvwnXQG5RzA83NXUWowxotAXXqURImqJwgJrouAkhT3vQt41czOl9QQaBq3fglw\nspltlPRlYCwwPP4gzjmXivIGcn8OeE7SsbHfGJ2rKePnFDC4Wyt6d2ie6VBc3XQxIdF1VzT/drSs\nXJJaAicBlwOY2R5gT+w2ZvZuzOxUoNuBh+ucq69SaV53VZTlD4CkNpL+mcaYnOOTtVuZV7CFc7xv\nNZcmZrbUzMaYWftoOsfMlqaway+gCHhQ0mxJ90edhifzLeCV6ojZOVc/pZJYG2xmm8pmzGwjcET6\nQnIu5Krl5oizDu+S6VBcHSWpm6RnJRVKWivpaUmp5IDlERpd3WNmRwDbgV8kOcdIQmLt+iTrr5Q0\nU9LMoqKiKl6Jc66uSyWxliNpX1M8SW3xAeBdGpWWGuNnr+L4Pu3p0KJRpsNxddeDwPNAF6Ar8EK0\nrCIrgZVmNi2af4qYFvNlJA0mNEIYY2brEx3IzMaa2VAzG9qhg3f67JxLLJXE2p+AdyXdJuk24F1S\naC3lXFXNWr6Rgk07OfcIz1VzadXBzB40s+JoegioMMVkZmuAFZL6RYtGE8ZN3kdSD+AZ4DIzW1TN\ncTvn6pkKE2tm9jBwHrAWKAS+amaPVLSfpO6SJkmaL+kjST9OsI0k/VXSYkkfSDoyZt03JH0STd+o\n3GW52uzZ2QU0aZDLqQM7ZToUV7etk3SppNxouhRImAOWwA+BcZI+AIYAv5V0laSrovW/BtoBf5c0\nR9LM6g/fOVdfVFicGX1D3EYoLti3zMyWV7BrMXCdmb0vqQUwS9IbZhb7DfTLQN9oGg7cAwyPilp/\nAwwlNKmfJen5qL6cq8N2F5fw0gerOW1QR5o18tJ2l1bfBO4G/kx4z7xLiqOzmNkcwvsp1r0x678N\nfLt6wnTO1Xep/Dd8ic+HZmkCHAwsJHSYm5SZrQZWR5+3SppPqBcSm1gbAzxsZgZMldRaUmdgBPCG\nmW0AkPQGcDrweIrX5WqpyQuL2Lxzr/et5tJKUi5wnpmdnelYnHOuIqkUgx5mZoOjqS8wjNAfUcok\n9SS0IJ0Wt6orsCJmfmW0LNlyV8eNn11Au2YNObFP+0yH4uowMyshfFl0zrmsV+lypqhY8+hUt5fU\nnDC+6DVmtiV+daJTlLM80fGvBK4E6NGjR6phuSy0eedeJiwo5OJhPcjLTaXti3MH5B1JdwP/JnS/\nAYR3XOZCcs65/aVSZ+0nMbM5hCbqKXUIJKkBIaE2zsyeSbDJSqB7zHw3YFW0fETc8smJzmFmYwlD\nuTB06NCECTpXO7w6bzV7iks514tAXc04Lvp5a8wyA0ZlIBbnnEsqlZy1FjGfiwl12J6uaCeFkbcf\nAOab2Z1JNnseuFrSE4QGBpvNbLWk1witq8r6dzsVuCGFWF0t9uzsAnq1b8bgbq0yHYqrB8xsZKZj\ncM65VFSYWDOzW6p47OOBy4APJc2Jlt0I9IiOey/wMnAGsBjYAVwRrdsQ9ek2I9rv1rLGBq5uWrVp\nJ1M/28C1pxxCSOc7l16S2hFanZ9AyFF7m/CuSbX7DuecqxFJE2uSXiBJPTGAilpRmdnbJK57FruN\nAT9Isu6fgI9BWk88P3cVAOd4R7iu5jwBTCH0IwlwCaH+2ikZi8g55xIoL2ftj9HPrwKdgEej+YuA\npWmMydVD42cXcGSP1hzUrrzxsJ2rVm3N7LaY+dslnZOxaJxzLomkTe7M7E0zexM4wswuMLMXouli\nQrGBq0PmFWzmhmc+ZMuuvTV+7vmrt7BgzVZvWOBq2iRJF0rKiaavEerkOudcVkmlf4QOknqVzUg6\nmBTGz3O1yz/e+ozHpy/n0vunsXlHzSbYxs8uIC9HfGWwF4G6GvVd4DFgdzQ9AfxE0lZJ8d0MOedc\nxqSSWLsWmCxpsqTJwCRgv3E+Xe1VUmpMWVRE/04tWLB6KxffP5WN2/fU2Lmfm7OKkw/pQNtmDWvk\nnM4BmFkLM8sxswbRlBMta2FmLTMdn3POlUllBINXCWN3/jia+pnZ6+kOzNWceQWb2bhjL1ed3Jv7\nvn4UnxRu46J/TGX9tt1pP/e0JetZs2UX53gRqHPOOZdQhYm1qGPb7wI3RdN3omWujpiyqAgJTuzb\nnpH98nngG0NZsm47F/1jKkVb05tgGz+7gOaN8jhlQMe0nsc555yrrVIpBr0HOAr4ezQdFS1zdcSb\ni4o4rGsr2jVvBMCJfTvw4BVHs2LDTi4c+x6FW3al5by79pbwyodrOG1QJ5o0zE3LOZxzzrnaLpXE\n2tFm9g0zmxhNVwApjw3qstvmnXuZvWITJx/yxTYjx/Vuz0NXHM3qzbu4YOxUVm/eWe3nnjC/kK27\ni70VqKtRktqWN2U6Pueci5dKYq1EUu+ymahlaEn6QnI16d3F6ygpNU46ZP8GvsN7teORbw2jaOtu\nLrhvKgWbqjfBNn5OAfktGnFs73bVelznKjALmBn9LAIWAZ9En2dlMC7nnEsolcTazwj9EU2W9CYw\nEbguvWG5mvLmoiJaNM7jiO6tE64/6qC2PPKtYWzcsYcL7nuPFRt2VMt5N27fw+SFhYwZ0oXcHB9e\nytUcMzvYzHoBrwFnmVl7M2sHnAk8k9nonHNuf+Um1iTlADsJrUF/FE39zGxSDcTm0szMeHNRESf0\naU9ebvJH4YgebRj37eFs3VXMBfe9x7L12w/43C99uJq9JcaYIV4E6jLmaDN7uWzGzF4BTs5gPM45\nl1C5iTUzKwX+ZGa7zewDM5trZunvz8HViE8Kt7F6866ERaDxBndrzbhvD2fn3hIuuG8qnxVtO6Bz\nj59dQN/85gzq4t1ZuYxZJ+lXknpKOkjSLwEfxN05l3VSKQZ9XdJ5krysqo6ZsqgI+P/t3XmYXGWZ\n/vHvnT2dhISsYFYIIYAIEdtI2CMOAqKCgyITBBk1gz9QcB2cqDgqjvuGYmwRgZmwuIAim6BAB8QA\nCQkQsjQhZGNLh0AWmpCk+/n9cU5LpdNLddPVp6rr/lxXXXXOe7anQnjznHPehbySNYCDRw/m2k8c\nzvb6Bj5cNY8V6zuWsK3dWMf81S9x6ltH479WlqEzSWZjuSn9jEjLzMyKSj7J2meB3wHbJW32VCzd\nR3VNLZNGDmT0kP55H3Pg3ntw/czDaQj4cNU/qHlhS7uv+6dFzwDw/imeXsqyExEbI+JC4OiIOCwi\nLoqIjVnHZWbWVD4zGOROybKHp2LpHl7dXs+DT2/cbciOfOw/ahDXzzycHhIfrprH0ufyz90jgpsW\nPsPUCUMZs2dFu69t1lkkHSFpCbAkXT9U0uUZh2Vmtpt8nqwh6QOSfijpB5JOLXRQVnjznn6R7Tsb\n8n4F2tR+Iwdyw39Mo2+vHpz5q3ksfmZTXsctfmYzT9W+4umlrBj8CHg3aTu1iHgUOCbTiMzMmpHP\ndFOXA+cBjwOLgfMk/X6gNkYAACAASURBVLzQgVlhVS+vpV/vHkzdp+NjgO4zfAA3zJzGgD69+Ldf\nzePRtS+3ecxNC5+hT88evOcte3f4umadJSLWNinyGJJmVnTyebJ2LPDuiPhNRPwGOBk4rqBRWcHN\nranl8H2H0a/3G5vmadywCq6feTiDK3pz1hUP8sial1rcd2d9Azc/+izTDxjB4ApPL2uZWyvpCCAk\n9ZH0eWBp1kGZmTWVT7K2HBiXsz4WeKww4VhXWLuxjpUbXulQe7XmjB1awQ0zpzF0YB/O/vVDzF/V\nfBvtB556kQ1bX+NUj61mxeE84HxgNLAOmJKum5kVlXyStWHA0nQGg3tJGuOOkHSzpJsLGp0VRHU7\nh+zIx5uG9OeGmdMYOagvZ1/5EPNW7j5c1R8XPsOgfr2YfsDITruuWUdFxIaImBERoyJiZEScFREe\nZ83Mik6vPPb5asGjsC5VXVPLmD37s+/wAZ163r0G9+P6mYfzb1c8yEd/8xBXnvN2jthvOAB123dy\nxxPP875D3/SGX72adQZJ3wW+STJLyx3AocBFEfF/mQZmZtZEPkN3VLf26YogrfNs39nAAys2cOz+\nIwoyIO3IPfpx3ScOZ/zQAZx71cP/HHj3riUvULe93r1ArZicEBGbSeYEXQfsTzIXsplZUclr6A7r\nPh5Z8xKvbK/v1FegTY0Y1JdrP/EO9h0xkI9fM597lq3njwuf4U2D+zF1Qsd7n5p1ssZeLicD13lA\nXDMrVgVL1iRdKWm9pMUtbP+CpEXpZ7GkeklD022rJD2ebptfqBjLUXVNLb16iCMmDivodYYN7Mt1\nn3gH+48ayH/87wLmPrmB900ZTY8enl7KisafJS0DKoG/SRoBbMvnQElDJP1e0jJJSyVNa7L9AEn/\nkPRa2svUzKzDWk3WJPWU1NH2G1cBJ7a0MSK+FxFTImIK8CWgusmd7fR0e2UHr2/NqF5ey9vG78mg\nfoUfOmNIRR/mfOxwDtx7EPUNwWl+BWpFJCIuBqYBlRGxA3gFeH+eh/8EuCMiDiBp69Z0yI+NwKeB\n73dSuGZWxlrtYBAR9ZJGSOoTEdvbc+KImCtpQp67nwlc157zW/ut37KNJc9t5osnTu6yaw6u6M21\nnzicp2q3MnmvQV12XbM8jQb+RVK/nLJrWjtA0h4kMx18FCCtG3epHyNiPbBe0ns6NVozK0v59AZd\nBfw9HabjlcbCiPhhZwQgqYLkCdwFOcUB3CkpgF9GRFVnXKvc3VezAYBjJhWuvVpzBvTtxSFjhnTp\nNc3aIukSkgG+DwJuA04C7qeNZA3YF6gFfiPpUGABcGFEvNL6YWZmHZNPm7VngVvSfQflfDrLe4G/\nN3kFemREHEZSeZ4vqcX5+iTNlDRf0vza2tpODKv7qa6pZfjAvhy09x5Zh2JWDE4Hjgeej4hzSV5n\n9s3juF7AYcAvIuKtJDexF3ckANdfZpaPNp+sRcR/FziGD9PkFWhEPJt+r5d0EzAVmNtCfFVAFUBl\nZWUUNtTSVd8Q3PdkLdMPGOlG/maJVyOiQdLO9NXmepKnZm1ZB6yLiAfT9d/TwWTN9ZeZ5aPNZC3t\nIfVF4M3AP9t1RMQ73+jFJQ0mmXv0rJyyAUCPiNiSLp8AfP2NXqvcLX5mEy/V7ei0KabMuoH5koYA\nvyJ5lbkVeKitgyLieUlrJU2OiOUkT+eWFDZUMytn+bRZmwPcQDJw5HnAOSTtNVol6TqS9iDDJa0D\nLiEd1ygiZqe7nQbc2aStxyjgpnTA1l7AtRFxRz4/xlpWXVOLBEd3cXs1s2IVEf8vXZwt6Q5gj4jI\nd97jTwFzJPUBVgLnSjovPe9sSXsB84E9gAZJFwEHpYPwmpm1Sz7J2rCI+LWkC9MZC6oltTlzQUSc\nmcc+V5EM8ZFbtpKk7Yh1ouqaWg4ZPZihA/pkHYpZ0ZA0GhhPWhdKOiYimm1ykSsiFpGMz5Zrds72\n54ExnRiqmZWxfJK1Hen3c2k39GdxJVRSNtXtYOGal7hg+n5Zh2JWNCR9BziD5BVmfVoctNA+1sws\nK/kka99M25Z9DriM5LH+ZwoalXWqvz+1gYagoFNMmZWgU4HJEfFa1oGYmbUmn96gt6SLm4DphQ3H\nCqF6eS2D+vViyliPdWaWYyVJO1ona2ZW1FpM1iRdRvJKoFkR8emCRGSdKiKorqnl6EnD6dWzYFPB\nmpWMnLqtDlgk6W/kJGyu28ys2LT2ZM0TqHcDNS9s5fnN2zxkh9nrGuu2BcDNWQZiZl1ozhyYNQvW\nrIFx4+DSS2HGjKyjykuLyVpEXN2VgVhhzK1JRllxezWzRGPdlo7juC0i6tP1nuQ3g4GZlZo5c2Dm\nTKirS9ZXr07WoSQSthbfi0n6cfr9Z0k3N/10XYj2RlTX1LL/qIHsPbh/1qGYFZu/Abn/Y/QH/ppR\nLGZWSLNmvZ6oNaqrS8pLQGuvQf83/f5+VwRina9u+04eenoj5xwxPutQzIpRv4jY2rgSEVslVWQZ\nkJkVyJo17SsvMi0+WYuIBel3dXOfrgvROurBlRvZXt/gV6BmzXtF0mGNK5LeBryaYTxmNmcOTJgA\nPXok33PmdM55x41rX3mRabN7oKRTJC2UtFHSZklbJHnKlBJQXVNLv949ePuEoVmHYlaMLgR+J+k+\nSfeRTKt3QcYxmZWvxnZlq1dDxOvtyjojYbv0Uqho8uC8oiIp7wyFSjJT+QyK+2PgA8DjEdHiUB5W\nfKprapm27zD69e6ZdShmRUVSD6APcAAwGRCwLCJ2tHqgmRVOa+3K3mgngMbjC9EbtAs6L+Qz8NZa\nYLETtdKy5sU6nt7wiofsMGtGRDQAP4iIHRGxOCIed6JmlrFCtyubMQNWrYKGhuS7s3qBdkHnhXye\nrH0RuC2dvD134MgfdloU1umqn/SQHWZtuFPSvwI3+mbUrAiMG5c8lWquvJh1QeeFfJ6sXUoy0nc/\nYFDOx4pY9fJaxg7tzz7DB2Qdilmx+izwO+A1t8c1KwKFbldWKF3QeSGfJ2tDI+KETruiFdz2nQ38\n46kNnHbYaCRlHY5ZUYoI33SaFZNCtisrpEsv3bXNGnR6kplPsvZXSSdExJ2ddlUrqAWrX+KV7fUc\nu//IrEMxK1qSjmmuPCLmdnUsZpaaMaP4k7OmuiDJzCdZOx/4oqTXgB0kvaYiIvbotCisU1XX1NKr\nh5g2cVjWoZgVsy/kLPcDppLMF/rObMIxs5JV4CSzzWTNrwpKT3VNLZUT9mRg33xycbPyFBHvzV2X\nNBb4bkbhmJm1qMV/zSUdEBHLckf4zhURjxQuLOuo9Zu3sfS5zfzniQdkHYpZqVkHHJx1EGZmTbX2\n6OWzwEzgB81sC/yqoCjNfXIDAMfsPzzjSMyKm6TLSOoySHrGTwEezS4iM7PmtZisRcTM9Ht614Vj\nb1R1TS0jBvXloL3dpNCsDfNzlncC10XE37MKxsysJS2Osybp7ZL2ylk/W9KfJP1UkiebLEL1DcF9\nT9ZyzKQRHrLDrA0RcTVwHbAQeAx4ONuIzEpEgefBtN21NijuL4Ht8M8u7t8GrgE2AVWFD83a6/Fn\nNvFy3Q6OnexZC8zaIulk4Cngp8DPgBWSTso2KrMiV8jJ1q1FrSVrPSNiY7p8BlAVEX+IiK8A+7V1\nYklXSlovaXEL24+TtEnSovTz1ZxtJ0paLmmFpIvb84PKWfXyWiQ4ej+3VzPLww+B6RFxXEQcC0wH\nfpRxTGbFrQvmwbTdtZqsSWps03Y8cHfOtnzGhLgKOLGNfe6LiCnp5+sAknoCPwdOAg4CzpR0UB7X\nK3vVNes5ZMwQ9hzQJ+tQzErB+ohYkbO+ElifVTBmJaEL5sG03bWWrF0HVEv6E/AqcB+ApP1IXoW2\nKh0FfGNb+zVjKrAiIlZGxHbgeuD9HThPWdlUt4NFa1/mWE/cbpavJyTdJumjks4B/gw8LOkDkj6Q\ndXBmRakL5sG03bWYrEXEpcDnSJ6QHRURuV3cP9VJ158m6VFJt0t6c1o2Glibs8+6tKxZkmZKmi9p\nfm1tbSeFVXruX7GBhsDJmln++gEvAMcCxwG1wFDgvcAp2YVlVsRKdbL1Etfq68yImNdMWU0nXfsR\nYHxEbE0b+v4RmEQyndVul20lxirSDg+VlZUt7tfdVdesZ49+vTh0zOCsQzErCRFxbtYxmBXMnDmF\nmauyVCdbL3GZzUcUEZtzlm+TdLmk4SRP0sbm7DoGeLar4yslEUF1TS1HTxpBr56tvdk2s+ZIeiQi\nmp2txazkNPbYbOwI0NhjEzovYXNy1qUy+5dd0l5KBwOTNDWN5UWSsY4mSdpHUh/gw8DNWcVZCpa/\nsIUXNr/mV6BmHdeugQklDZH0e0nLJC2VNK3JdqVjUq6Q9FhL0/aZFYR7bHY7BXuyJuk6knYgwyWt\nAy4BegNExGzgdOCTknaSdGD4cNoubqekC4C/AD2BKyPiiULF2R3MrUna6h3tKabMOurWdu7/E+CO\niDg9vals0oiHk0iadUwC3gH8Iv02Kzz32Ox2CpasRcSZbWz/GclAlM1tuw24rRBxdUfVNbVMHjWI\nvQf3zzoUs5IiaRTwdmCepJER0ebQHZL2AI4BPgqQ9lrf3mS39wPXpDeg89IncXtHxHOd+gPMmjNu\nXPLqs7lyK0lu4FTi6rbv5OGnX/KsBWbtJOlDwEPAB4EPAQ9KOj2PQ/cl6Tn6G0kLJV0haUCTfdrV\nq92sU7nHZrfjZK3EzVv5ItvrG9xezaz9ZgFvj4hzIuJskjEev5LHcb2Aw4BfRMRbgVeApjOt5NWr\n3UMPWUHMmAFVVTB+PEjJd1WVOwWUMCdrJa56eS39e/ekcsKeWYdiVmp6NHnt+SL51YnrgHUR8WC6\n/nuS5K3pPm32ao+IqoiojIjKESN8w2WdaMYMWLUKGhqSbydqJc3JWomrrqll2sRh9O3VM+tQzErN\nHZL+ks5g8FGSTga3t3VQRDwPrJU0OS06HljSZLebgbPTXqGHA5vcXs3MOiqzcdbsjVv94iuserGO\nc4/cJ+tQzEpORHwhnVbqKJLXllURcVOeh38KmJP2BF0JnCvpvPS8s0k6SJ0MrADqAA/Aa2Yd5idr\nJaxxyI5j3F7NLG+S9pN0JEBE3BgRn42IzwAvSpqYzzkiYlH6+vKQiDg1Il6KiNlpokYkzo+IiRHx\nloiYX8CfZHPmwIQJ0KNH8j1nTtYRmXUqJ2slrLqmlnFDK5gwrOkQT2bWih8DW5opr0u3WSlpHK1/\n9WqIeH20fids1o04WStR23c28MBTL3Ls/iNIJ4Iws/xMiIjHmhamT78mdH049oZ4tH4rA07WStT8\n1Rup217vITvM2q9fK9s8snSp8Wj9VgacrJWo6ppaevcU0yYOyzoUs1LzsKRPNC2U9DFgQQbx2BvR\n0qj8Hq3fuhEnayWqenktleOHMqCvO/SatdNFJL0375X0g/RTDXwcuDDj2Ky9Cj1avzsvWBHwv/Ql\n6IXN21j2/BYuPumArEMxKzkR8QJwhKTpwMFp8a0RcXeGYVlHNQ72OmtW8upz3LgkUeuMQWAbOy80\ntolr7LyQe12zLuBkrQQ1Dtnh9mpmHRcR9wD3ZB2HdYIZMwqTPLXWecHJmnUhvwYtQdU1tYwc1JcD\n9hqUdShmZt2XOy9YkXCyVmLqG4L7ntzAMR6yw8yssNx5wYqEk7US89i6l9n06g6/AjUzK7RCd14w\ny5OTtRJTXVOLBEftNzzrUMzMurcZM6CqCsaPByn5rqpyezXrcu5gUGKqa2o5dMwQ9hzQJ+tQzMy6\nv0J1XjBrBz9ZKyEv123n0bUv+xWomZlZGXGyVkL+tnQ9DQHHTnayZmZmVi78GrQEbNj6Gj+8q4br\nH1rD2KH9OXTMkKxDMjMzsy7iZK2Ivbaznt/8fRU/v3sFr+6o5+xpE7joXZPo2cNDdpiZmZWLgiVr\nkq4ETgHWR8TBzWyfAfxnuroV+GREPJpuWwVsAeqBnRFRWag4i1FEcPvi5/mf25eyduOrHH/ASP7r\nPQcyccTArEMzMzOzLlbIJ2tXAT8Drmlh+9PAsRHxkqSTgCrgHTnbp0fEhgLGV5QeX7eJb9yyhIdW\nbWTyqEH878emcvQkt1EzMzMrVwVL1iJirqQJrWx/IGd1HjCmULGUghc2b+O7dyznxoXrGFrRh0tP\nO5gzKsfSq6f7gJiZmZWzYmmz9jHg9pz1AO6UFMAvI6Iqm7AK79Xt9VTNXcns6qeobwhmHrMv50/f\njz369c46NDMzMysCmSdrkqaTJGtH5RQfGRHPShoJ3CVpWUTMbeH4mcBMgHElNF9bQ0Nw86PP8p07\nlvHcpm2c/Ja9uPjEAxk3rKLtg83MzKxsZPqOTdIhwBXA+yPixcbyiHg2/V4P3ARMbekcEVEVEZUR\nUTliRGm07VqweiOn/eIBLrphEcMH9uWGmYdz+Yy3OVEzs+5rzhyYMAF69Ei+58zJOiKzkpHZkzVJ\n44AbgY9ERE1O+QCgR0RsSZdPAL6eUZidat1LdXz79mXc8thzjNqjL9//4KF84K2j6eGhOMysO5sz\nB2bOhLq6ZH316mQdPJWTWR4KOXTHdcBxwHBJ64BLgN4AETEb+CowDLhcErw+RMco4Ka0rBdwbUTc\nUag4u8LW13Zy+T0ruOL+p+kh+PTxkzjv2H2p6JP5W2gzs8KbNev1RK1RXV1S7mTNrE2F7A16Zhvb\nPw58vJnylcChhYqrK9U3BL9fsJbv/aWGDVtf47S3juYL757Mm4b0zzo0M7Ous2ZN+8rNbBd+tFMg\nDzy1gW/espQlz23mbeP35IpzKpky1tNEmVkZGjcuefXZXLmZtcnJWid7esMrfOu2pdy15AVGD+nP\nZWe+lVMO2Zv0ta6ZWfm59NJd26wBVFQk5WbWJidrnWTTqzu47G9PcvU/VtGnZw++8O7JfOyofejX\nu2fWoZmZZauxXdqsWcmrz3HjkkTN7dXM8uJk7Q3aWd/AtQ+t4Ud31fDyqzs4o3Isnz1hf0YO6pd1\naGZmxWPGDCdnZh3kZO0NuGf5ei69dSkr1m9l2r7D+PIpB/LmNw3OOiwzKzBJq4AtQD2v92TP3b4n\ncCUwEdgG/HtELO7qOM2se3Cy1gE1L2zhm7cuZW5NLROGVVD1kbfxLweNcrs0s/IyPSI2tLDtv4BF\nEXGapAOAnwPHd11oZtadOFlrh42vbOdHd9Vw7UNrGNCnJ19+z4GcPW0CfXp5snUz28VBwP8ARMQy\nSRMkjYqIFzKOy8xKkJO1PGzf2cDVD6zip3c/Sd32es56xzgufNf+DB3QJ+vQzCwbAdwpKYBfRkRV\nk+2PAh8A7pc0FRgPjAGcrJlZuzlZa0VE8JcnXuB/bl/K6hfrOG7yCGadfCCTRg3KOjQzy9aREfGs\npJHAXZKWRcTcnO3fBn4iaRHwOLAQ2Nn0JJJmAjMBxnnMMTNrgZO1Fix+ZhPfvHUJ81ZuZNLIgVz9\n71M5dv/SmCjezAorIp5Nv9dLugmYCszN2b4ZOBdASWPWp9NP0/NUAVUAlZWVUfjIzawUOVlrYv3m\nbXz/zuX8bsE6hvTvzTdOPZgz3z6WXj3dLs3MQNIAoEdEbEmXTwC+3mSfIUBdRGwnmVZvbprAmZm1\nm5O11LYd9Vxx30ouv/cpdtQ38PGj9uGCd05icP/eWYdmZsVlFHBT2vu7F3BtRNwh6TyAiJgNHAhc\nI6keWAJ8LKtgzaz0lX2yFhH8+bHn+M7ty3jm5Vd595tH8aWTDmTC8AFZh2ZmRSgiVgKHNlM+O2f5\nH8CkrozLStCcOZ7VwfJS1snawjUv8Y1blvDImpd585v24PsfPJRpE4dlHZaZmXV3c+bsOl/q6tXJ\nOjhhs92UZbL27Muv8p07lvGnRc8yYlBfvnv6IfzrYWPo2cOD2pqZWReYNWvXie0hWZ81y8ma7aYs\nk7Wv/HEx96/YwAXT9+O84yYysG9Z/jGYmVlW1qxpX7mVtbLMUr5yykH07tWD0UP6Zx2KmZmVo3Hj\nklefzZWbNVGW41FMGD7AiZqZmWXn0kuhomLXsoqKpNysibJM1szMzDI1YwZUVcH48SAl31VVbq9m\nzSrL16BmZmaZmzHDyZnlxU/WzMzMzIqYkzUzMzOzIuZkzczMzKyIFTRZk3SlpPWSFrewXZJ+KmmF\npMckHZaz7RxJT6afcwoZp5mZmVmxKvSTtauAE1vZfhLJ/HmTgJnALwAkDQUuAd4BTAUukbRnQSM1\nMzMzK0IFTdYiYi6wsZVd3g9cE4l5wBBJewPvBu6KiI0R8RJwF60nfWZmZmbdUtZt1kYDa3PW16Vl\nLZXvRtJMSfMlza+trS1YoGZmZmZZyDpZa27m9GilfPfCiKqIqIyIyhEjRnRqcGZmZmZZy3pQ3HXA\n2Jz1McCzaflxTcrvbetkCxYs2CCpmcnWmjUc2JDnvsXEcXetUo0bSjf29sQ9vpCBdKUyqb+gdGN3\n3F2rXOLOqw7LOlm7GbhA0vUknQk2RcRzkv4CfCunU8EJwJfaOllE5P1oTdL8iKjsSNBZctxdq1Tj\nhtKNvVTjfqPKof6C0o3dcXctx72rgiZrkq4jeUI2XNI6kh6evQEiYjZwG3AysAKoA85Nt22U9A3g\n4fRUX4+I1joqmJmZmXVLBU3WIuLMNrYHcH4L264ErixEXGZmZmalIusOBlmqyjqADnLcXatU44bS\njb1U4+5KpfxnVKqxO+6u5bhzKHm4ZWZmZmbFqJyfrJmZmZkVvbJM1iSdKGl5OifpxVnHk4+25lkt\nVpLGSrpH0lJJT0i6MOuY8iGpn6SHJD2axv3fWcfUHpJ6Sloo6ZasY8mXpFWSHpe0SNL8rOMpVqVY\nf0Fp1mGuv7JRivUXFLYOK7vXoJJ6AjXAv5CM5/YwcGZELMk0sDZIOgbYSjI918FZx5OvdPqwvSPi\nEUmDgAXAqSXw5y1gQERsldQbuB+4MJ0WrehJ+ixQCewREadkHU8+JK0CKiOiFMdW6hKlWn9BadZh\nrr+yUYr1FxS2DivHJ2tTgRURsTIitgPXk8xRWtTymGe1KEXEcxHxSLq8BVhKC1OHFZN0vtqt6Wrv\n9FMSdzaSxgDvAa7IOhbrdCVZf0Fp1mGuv7qe66/mlWOylve8o9a5JE0A3go8mG0k+UkfxS8C1gN3\nRURJxA38GPgi0JB1IO0UwJ2SFkiamXUwRcr1V0Zcf3WZUq2/oIB1WDkma3nPO2qdR9JA4A/ARRGx\nOet48hER9RExhWS6s6mSiv7VjaRTgPURsSDrWDrgyIg4DDgJOD99bWa7cv2VAddfXaPE6y8oYB1W\njslaS/ORWoGkbSb+AMyJiBuzjqe9IuJlkrlpT8w4lHwcCbwvbTtxPfBOSf+XbUj5iYhn0+/1wE0k\nr/xsV66/upjrry5VsvUXFLYOK8dk7WFgkqR9JPUBPkwyR6kVQNrQ9dfA0oj4Ydbx5EvSCElD0uX+\nwLuAZdlG1baI+FJEjImICSR/t++OiLMyDqtNkgakDbiRNIBkPuCS6TXYhVx/dSHXX12rVOsvKHwd\nVnbJWkTsBC4A/kLSWPS3EfFEtlG1LZ1n9R/AZEnrJH0s65jydCTwEZI7pEXp5+Ssg8rD3sA9kh4j\n+QfyrogoqW7kJWYUcL+kR4GHgFsj4o6MYyo6pVp/QcnWYa6/LF8FrcPKbugOMzMzs1JSdk/WzMzM\nzEqJkzUzMzOzIuZkzczMzKyIOVkzMzMzK2JO1szMzMyKmJO1MifpNEkh6YBOPGdvSd+W9KSkxZIe\nknRSB84zpUS6ySNpgqR/y1mvlPTTLGMy6+5cf3UO11/Fz8manQncTzIAYWf5Bsk4PwdHxMHAe4FB\nHTjPFKBLKztJvTqyDZgA/LOyi4j5EfHpTgzNzHbn+iuH669uLCL8KdMPMBB4BtgfWJZTfgNwcs76\nVcC/AhXAb4HH0n0eBCqbnLMCeBHYo4Vrbs1ZPh24Kl3+IMloz48Cc4E+wBqgFlgEnAEMBf6YXn8e\ncEh67NeAq4E7gVXAB4DvAo8DdwC90/3eBlQDC0gGFd07Lb8X+Fa67XNN4v0aUJWe+1qSSu0+4JH0\nc0S63zxgUxrrZ4DjgFtyznFlep2VwKdzzv8VkpHF7wKuAz6f9d8Lf/wphY/rL9df5fTJPAB/MvyP\nD2cBv06XHwAOS5dPA65Ol/sAa4H+wOeBX6blBwM7m6nsDgEWtnLNliq7x4HR6fKQ9PujwM9y9r8M\nuCRdfiewKF3+GsnddW/gUKAOOCnddhNwarrtAWBEWn4GcGW6fC9weQvxfi2tHPun6xVAv3R5EjA/\nXf5n5dZ0PT3HA0BfYDjJPwa9gcq0cuxPcuf+pCs7f/zJ7+P6y/VXOX1aeyxq3d+ZwI/T5evT9UeA\n24GfSupLMvnv3Ih4VdJRwE8AImJxOpVJZ/k7cJWk3wItTZZ8FMkdMhFxt6Rhkgan226PiB2SHgd6\nktyRQlKJTgAmk1TQdyXT/dETeC7n3De0EtvNEfFqutwb+JmkKUA9yV19Pm6NiNeA1yStJ5ma5Cjg\nT43nlvTnPM9lZq6/XH+VESdrZUrSMJK7u4MlBcn//CHpixGxTdK9wLtJ7uCuazwsj1OvAMZJGhQR\nW5rZnju/Wb9/FkacJ+kdwHuARWllslvYrZzvtfQ8DZJ2RHpLCDSQ/D0X8ERETGsh7lda/EW7bvsM\n8ALJHXAPYFsrx+V6LWe5PicmM2sn11+7cf3VzbmDQfk6HbgmIsZHxISIGAs8TXK3BMmd6rnA0STt\nIyB5VP8hAEkHAW9petKIqAN+TXJn2yfdd29JZ6W7vCDpQEk9SF5XkO4zMSIejIivAhuAscAWdm3Y\nOxeYke5/HLAhIjbn+XuXAyMkTUuP7y3pzXkem2sw8FxENJBM8NwzLW8aaz7uB94rqZ+kgSQVvZm1\nzfWX66+y4mStfJ1J0h4i1x94vUfQncAxwF8jYntadjlJhfEY8J8kDWU3NXPuL5M0rF0iaTFJo9ra\ndNvFwC3A3ez6LgaTKQAABRdJREFUGP97kh5P959L0lD3HuAgSYsknUHSdqIyvf63gXPy/bHpbzgd\n+I6kR0naWhyR7/E5LgfOkTSP5BVC413rY8BOSY9K+kyeMT0M3EzyW28E5tP8n6eZ7cr1l+uvsqLX\nn7aatU5ST5KeSdskTQT+BuyfUxlaO0kaGBFbJVWQVPIzI+KRrOMy625cf3U+119dx23WrD0qgHsk\n9SZpr/BJV3RvWFX6SqYfSQ82V3RmheH6q/O5/uoifrJmZmZmVsTcZs3MzMysiDlZMzMzMytiTtbM\nzMzMipiTNTMzM7Mi5mTNzMzMrIg5WTMzMzMrYk7WzMzMzIqYkzUzMzOzItbtkjVJe0m6XtJTkpZI\nuk3S/h04z6npyMxFT9Jxko7IWT9P0tlZxmRm7ef6y/WXWXO6VbImSSST+94bERMj4iDgv4BRHTjd\nqUCXVnbp3HUtbWttarDjyJnUNyJmR8Q1nRiamRWY66+E6y+z3XWrZA2YDuyIiNmNBRGxKCLuS+/e\nbmksl/QzSR9Nl7+d3sU+Jun76V3e+4DvSVokaaKkKZLmpfvcJGnP9Nh7Jf1I0lxJSyW9XdKNkp6U\n9M2c650l6aH0fL9srNgkbZX0dUkPAtNyf0x67m9JqgYulPReSQ9KWijpr5JGSZoAnAd8Jj330ZK+\nJunzOef4TnrtGklHp+UVkn6b/p4b0vNWSuop6SpJiyU9Lukznf+fycya4frL9ZdZs7rbRO4HAwva\nc4CkocBpwAEREZKGRMTLkm4GbomI36f7PQZ8KiKqJX0duAS4KD3N9og4RtKFwJ+AtwEbgack/QgY\nCZwBHBkROyRdDswArgEGAIsj4qsthDgkIo5NY9gTODyN8+PAFyPic5JmA1sj4vvpfsc3OUeviJgq\n6eQ07ncB/w94KSIOkXQwsCjddwowOiIOTs81pD1/nmbWYa6/cP1l1pzulqx1xGZgG3CFpFuBW5ru\nIGkwSaVTnRZdDfwuZ5eb0+/HgSci4rn0uJXAWOAokgrwYUkA/YH16TH1wB9aie+GnOUxwA2S9gb6\nAE/n+RtvTL8XABPS5aOAnwBExOK0MgdYCewr6TLgVuDOPK9hZl3P9ZfrLysD3e016BMklUpzdrLr\n7+0HEBE7gakkFc6pwB0duO5r6XdDznLjei9AwNURMSX9TI6Ir6X7bIuI+lbO/UrO8mXAzyLiLcB/\nNP6GdsRXz+sJuprbMSJeAg4F7gXOB67I8xpm9sa4/mo9PtdfVra6W7J2N9BX0icaC9I2GMcCq4GD\nJPVN7zSPT7cPBAZHxG0krwWmpIduAQYBRMQm4KXG9hLAR4DGu9R8/A04XdLI9JpDJY3vwO8bDDyT\nLp+TU/7PWNvhfuBDaTwHAW9Jl4cDPSLiD8BXgMM6EKeZtZ/rr/y5/rKy0q1eg6ZtIU4DfizpYpLX\nA6uAiyJiraTfAo8BTwIL08MGAX+S1I/kbq2xQer1wK8kfRo4naRymS2pguRR+7ntiGuJpC8Dd0rq\nAewguetb3c6f+DXgd5KeAeYB+6TlfwZ+L+n9wKfyPNflwNXp64OFJH8um4DRwG/SOAG+1M4YzawD\nXH+5/jJriSIi6xgsA0p6c/WOiG2SJpLcPe8fEdszDs3MrFWuv6zcdKsna9YuFcA9knqT3JF/0hWd\nmZUI119WVvxkzczMzKyIdbcOBmZmZmbdipM1MzMzsyLmZM3MzMysiDlZMzMzMytiTtbMzMzMipiT\nNTMzM7Mi9v8BNaxLnms6HtwAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x1ce44e5cd68>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "f, (ax1, ax2) = plt.subplots(1, 2, sharex=False, sharey=False, figsize=(10,5))\n",
    "plt.suptitle(\"\"\"Product review ratings\"\"\", fontsize=16)\n",
    "ax1.plot(summ2)\n",
    "ax1.set_xlabel(\"Avg Customer rating\")\n",
    "ax1.set_ylabel(\"Similar products (avg count)\")\n",
    "ax1.set_title(\"Rating relationship to similar pairs\")\n",
    "ax1.annotate('Customer ratings', (0,0), (0, -40), xycoords='axes fraction', textcoords='offset points', va='top')\n",
    "ax2.plot(summ3, 'ro')\n",
    "ax2.set_xlabel(\"Avg Customer rating\")\n",
    "ax2.set_ylabel(\"Co-purchased products (avg count)\")\n",
    "ax2.set_title(\"Rating relationship to co-purchase\")\n",
    "ax2.annotate('Customer ratings', (0,0), (0, -40), xycoords='axes fraction', textcoords='offset points', va='top')\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
